{"text": "T a x Sa vi n g S tr at e gi e s : A H e l p fu l C he ckl i st Table of Contents • Avoid or Defer Income Recognition • Max Out Your 401(k) or Similar Employer Plan • If You Have Your Own Business, Set Up and Contribut e to a Retirement Plan • Contribute to an IRA • Defer Bonuses or Other Earned Income • Accelerate Capital Losses and Defer Capital Gains • Watch Trading Activity In Your Portfolio • Use the Gift-Tax Exclusion to Shift Income • Invest in Treasury Securities • Consider Tax-Exempt Municipals • Give Appreciated Assets to Charity • Keep Track of Mileage Driven for Business, Medical or Charitable Purposes • Take Advantage of Your Employer's Benefit Plans to Get an Effective Deduction for Items Such as Medical Expenses • Check Out Separate Filing Status • If Self-Employed, Take Advantage of Special Deducti ons • If Self-Employed, Hire Your Child in the Business • Take Out a Home-Equity Loan • Bunch Your Itemized Deductions This Financial Guide provides tax saving strategies for deferring income and maximizing deductions, an d includes some strategies for specific categories of individu als, such as those with high income and those who a re self- employed. Before getting into the specifics, however, we woul d like to stress the importance of proper documenta tion. Many taxpayers forgo worthwhile tax deductions because t hey have neglected to keep receipts or records. Kee ping adequate records is required by the IRS for employe e business expenses, deductible travel and entertai nment expenses, and charitable gifts and travel. But don' t do it just because the IRS says so. Neglecting to track these deductions can lead to overlooking them. You also n eed to maintain records regarding your income. If y our receive a large tax-free amount, such as a gift or inheritance, make certain to document the item so t hat the IRS does not later claim that you had unreported income . The checklist items listed below are for general in formation only and should be tailored to your speci fic situation. If you think one of them fits your tax situation, we'd be happy to discuss it with you. Avoid or Defer Income Recognition Deferring taxable income makes sense for two reason s. Most individuals are in a higher tax bracket in their working years than they are during retirement. Defe rring income until retirement may result in paying taxes on that income at a lower rate. Additionally, through the u se of tax-deferred retirement accounts you can actu ally invest the money you would have otherwise paid in taxes to increase the amount of your retirement fund. Defer ral can also work in the short term if you expect to be in a lower bracket in the following year or if you can take advantage of lower long-term capital gains rates by holding a n asset a little longer. Tip: You can achieve the same effect of deferring incom e by accelerating deductions, for example, by payin g a state estimated tax installment in December instead of at the following January due date. Max Out Your 401(k) or Similar Employer Plan Many employers offer plans where you can elect to d efer a portion of your salary and contribute it to a tax- deferred retirement account. For most companies the se are referred to as 401(k) plans. For many other employers, such as universities, a similar plan cal led a 403(b) is available. Check with your employer about the availability of such a plan and contribute as much as possible to defer income and accumulate retireme nt assets. Tip: Some employers match a portion of employee contrib utions to such plans. If this is available, you sho uld structure your contributions to receive the maximum employer matching contribution. If You Have Your Own Business, Set Up and Contribut e to a Retirement Plan If you have your own business, consider setting up and contributing as much as possible to a retiremen t plan. These are allowed even for sideline or moonlighting businesses. Several types of plans are available w hich minimize the paperwork involved in establishing and administering such a plan. Related Guide: For details on Keogh plans and other retirement pl ans benefiting self-employed owners, see the Financial Guide: EMPLOYEE BENEFITS: How To Handle Them. Contribute to an IRA If you have income from wages or self-employment in come, you can build tax-sheltered investments by contributing to a traditional or a Roth IRA. You ma y also be able to contribute to a spousal IRA -even where the spouse has little or no earned income. All IRAs def er the taxation of IRA investment income and in som e cases can be deductible or be withdrawn tax free. Related Guide: For details on how Roth IRAs work and how they com pare in other respects with traditional IRAs, please see the Financial Gui de: ROTH IRAs: How They Work and How To Use Them. Related Guide: For details on the Coverdell Education Savings Acc ount (formerly the Education IRA) - special purpose vehicles for higher education - please see the Financial Guide: HIGHER EDUCATION COSTS: How To Get The Maximum Deduction. Tip: To get the most from IRA contributions, fund the I RA as early as possible in the year. Also, pay the IRA trustee out of separate funds, not out of the amoun t in the IRA. Following these two rules will ensure that you get the most possible tax-deferred earnings from your m oney. Defer Bonuses or Other Earned Income If you are due a bonus at year-end, you may be able to defer receipt of these funds until January. Thi s can defer the payment of taxes (other than the portion withhe ld) for another year. If you're self employed, defe r sending invoices or bills to clients or customers until aft er the new year begins. Here, too, you can defer so me of the tax, subject to estimated tax requirements. This may eve n save taxes if you are in a lower tax bracket in t he following year. Note, however, that the amount subject to soc ial security or self-employment tax increases each year. Accelerate Capital Losses and Defer Capital Gains If you have investments on which you have an accumu lated loss, it may be advantageous to sell it prior to year- end. Capital losses are deductible up to the amount of your capital gains plus $3,000. If you are plan ning on selling an investment on which you have an accumula ted gain, it may be best to wait until after the en d of the year to defer payment of the taxes for another year (sub ject to estimated tax requirements). For most capit al assets held more than 12 months (long-term capital gains) the maximum capital gains tax is 15 percent, but is set to expire at the end of 2012. However, make sure to co nsider the investment potential of the asset. It ma y be wise to hold or sell the asset to maximize the economic gai n or minimize the economic loss. Watch Trading Activity In Your Portfolio When your mutual fund manager sells stock at a gain , these gains pass through to you as realized taxab le gains, even though you don't withdraw them. So you may pre fer a fund with low turnover, assuming satisfactory investment management. Turnover isn't a tax conside ration in tax-sheltered funds such as IRAs or 401(k )s. For growth stocks you invest in directly and hold for t he long term, you pay no tax on the appreciation un til you sell them. No capital gains tax is imposed on appreciati on at your death. Use the Gift-Tax Exclusion to Shift Income You can give away $13,000 ($26,000 if joined by a s pouse) per donee in 2012 (same as 2011), per year w ithout paying federal gift tax. You can give $13,000 to as many donees as you like. The income on these trans fers will then be taxed at the donee's tax rate, which is in many cases lower. Note: Special rules apply to children under age 18. Also , if you directly pay the medical or educational ex penses of the donee, such gifts will not be subject to gif t tax. Invest in Treasury Securities For high-income taxpayers, who live in high-income- tax states, investing in Treasury bills, bonds, and notes can pay off in tax savings. The interest on Treasuries is exempt from state and local income tax. Also, in vesting in Treasury bills that mature in the next tax year res ults in a deferral of the tax until the next year. Consider Tax-Exempt Municipal Bonds Interest on state or local municipal bonds is gener ally exempt from federal income tax and from tax by the issuing state or locality. For that reason, interest paid o n such bonds is somewhat less than that paid on com mercial bonds of comparable quality. However, for individua ls in higher brackets, the interest from municipal bonds will often be greater than from higher paying commercial bonds after reduction for taxes. Gain on sale of m unicipal bonds is taxable and loss is deductible. Tax-exempt interest is sometimes an element in computation of other tax items. Interest on loans to buy or carry tax-exempt s is non-deductible. Give Appreciated Assets to Charity If you're planning to make a charitable gift, it ge nerally makes more sense to give appreciated long-t erm capital assets to the charity, instead of selling the asset s and giving the charity the after-tax proceeds. Do nating the assets instead of the cash prevents your having to pay capital gains tax on the sale, which can result in considerable savings, depending on your tax bracket and the amount of tax that would be due on the sal e. Additionally you can obtain a tax deduction for the fair market value of the property. Tip: Many taxpayers also give depreciated assets to cha rity. Deduction is for fair market value; no loss d eduction is allowed for depreciation in value of a personal asset. Depending on the item donated, there may be strict valuation rules and deduction limits. Keep Track of Mileage Driven for Business, Medical or Charitable Purposes If you drive your car for business, medical or char itable purposes, you may be entitled to a deduction for miles driven. For 2012, it's 55.5 cents per mile for busi ness, 23 cents for medical and moving purposes, and 14 cents for service for charitable organizations. You need to keep detailed daily records of the mileage drive n for these purposes to substantiate the deduction. Take Advantage of Your Employer's Benefit Plans to Get an Effective Deduction for Items Such as Medical Expenses Medical and dental expenses are generally only dedu ctible to the extent they exceed 7.5% of your adjus ted gross income (AGI). For most individuals, particularly th ose with high income, this eliminates the possibili ty for a deduction. You can effectively get a deduction for these items if your employer offers a Flexible Spen ding Account, sometimes called a cafeteria plan. These p lans permit you to redirect a portion of your salar y to pay these types of expenses with pre-tax dollars. Anoth er such arrangement is a Health Savings Account. As k your employer if they provide either of these plans. Check Out Separate Filing Status Certain married couples may benefit from filing sep arately instead of jointly. Consider filing separat ely if you meet the following criteria: • One spouse has large medical expenses, miscellaneou s itemized deductions, or casualty losses. • The spouses' incomes are about equal. Separate filing may benefit such couples because th e adjusted gross income \"floors\" for taking the lis ted deductions will be computed separately. On the othe r hand, some tax benefits are denied to couples fil ing separately. In some states, filing separately can a lso save a significant amount of state income taxes . If Self-Employed, Take Advantage of Special Deducti ons You may be able to expense up to $500,000 in 2012 f or qualified equipment purchases for use in your bu siness immediately instead of writing it off over many yea rs. Additionally, self-employed individuals can ded uct 100% of their health insurance premiums as business expense s. You may also be able to establish a Keogh, SEP o r SIMPLE plan, or a Health Savings Account, as mentio ned above. If Self-Employed, Hire Your Child in the Business If your child is under age 18, he or she is not sub ject to employment taxes from your unincorporated b usiness (income taxes still apply). This will reduce your i ncome for both income and employment tax purposes a nd shift assets to the child at the same time; however, you cannot hire your child if he or she in under the ag e of 8 years old. Take Out a Hom e-Equity Loan Most consumer related interest expense, such as fro m car loans or credit cards, is not deductible. Int erest on a home-equity loan, however, can be deductible. It ma y be advisable to take out a home-equity loan to pa y off other nondeductible obligations. Bunch Your Itemized Deductions Certain itemized deductions, such as medical or emp loyment related expenses, are only deductible if th ey exceed a certain amount. It may be advantageous to delay p ayments in one year and prepay them in the next yea r to bunch the expenses in one year. This way you stand a better chance of getting a deduction."}
{"text": "1 Disclaimer This material & presentation content is for informational and educational purposes only. This material and presentation content is designed to provide general information regarding the subject matter covered. It is not intended to serve as legal, tax, or other financial advice related to individual situations. Because each individual’s legal, tax, and financial s ituation is different, specific advice should be tailored to the particular circumstances. For this reason, you are advised to consult with your own attorney, accountant, tax preparer, and/or other advisor regarding you r specific situation or your client’s specific situation. The information and all accompanying material are for your use and convenience only. We, Advanced Tax Advisors, and its third party affiliates and presenters, have taken reasonable precautions in the preparation of this material and believe that the information presented in this material is accurate as of the date it was written. However, we will assume no responsibility for any errors or omissions. We specifically disclaim any liability resulting from the use or application of the information contained in this publication. To ensure compliance with requirements imposed by the IRS, we inform you that any US federal tax advice contained in this com munication (including any attachments) is not intended or written to be used, and it cannot be used for the purpose of (i) avoiding penalties under the Internal Revenue Code or (ii) promoting, marketing, or recommending to another party any transaction or matter addressed herein. Always seek advice based on your particular circumstances from an independent advisor. 2 Table of Contents 1.Maximize Deductions Home Office Travel Expenses Meal Categories Hiring Children & Grandparents Maximize Depreciation Health Care Strategies Fringe Benefits Accountable Plans Medical Reimbursement Plan Home Administrative Office 2. Legal Entity Optimization Schedule C To S -Corp S-Corp To C -Corp Late S Elections 3.Retirement Planning Profit -sharing Retirement Plan Traditional 401(k)Roth 401(k) Cash Balance Plan Self-Directed Retirement Funds Defined Benefit Plans412(e)(3) Plan 4. Insurance Captive Insurance 5.Legal Loopholes Augusta Loophole QEAAP 6.Niche Strategies 1031 Exchange Cost SegregationPassive Real Estate Losses FICA Tip Credit Research & Development Tax Credit Self Employed Health Insurance Premium Credit Work Opportunity Tax Credit 7. Advanced Strategies Deferred Compensation Tax Loss Harvesting (Investments) Conservation Easements Cooperatives6 7 8 9 10 11 1213 14 15 16 17 18 18 19 20 21 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 3 Table of Contents 7.Advanced Strategies (continued) Family Office Management Company Revenue Stream Bifurcation Charitable LLCs Freeze Transactions With GRATs And IDGTs 8. Exits & Capital Gains Installment Sales Deferred Gains -DST QSBS Election ESOP / ESOTESOPs 9.Gift & Estate Planning Charitable Remainder Trusts Family Trusts 10. Tax Cuts & Jobs Act 199A C-Corp Tax Rate Opportunity Zone Credit Favorable Depreciation Rules Non-Grantor Trusts And Section 199A Non-Grantor Trusts And Section 1202 C Corps And The “GILTI” Tax C Corps And FDII 11. Asset Protection Family Limited Liability Company (“FLLC”) Exempt Asset Planning With ERISA Plans Exempt Asset Planning With Private Placement Life Insurance (“PPLI”) Exempt Asset Planning With Private Placement Variable Annuities (“PPVA”) Offshore Asset Protection Trust (“OAPT”) 12.International Puerto Rico Act 20&22 U.S. Virgin Islands EDC Program 13. Other Strategies Cost Remediation46 47 48 49 50 51 52 53 54 55 56 5758 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 4 MAXIMIZE DEDUCTIONS 5 Strategy: Home Office Description Ifyour office space islocated inyour house, you can deduct your bills for utilities, homeowners’ insurance, homeowners association fees, security, and general repairs and maintenance. Mortgage interest and property taxes are deductible expenses ifyouqualify forhome office deductions .You candeduct thepercentage ofthesquare footage ofyour office divided bythetotal square footage ofyour house. CalculationTaxRate XSavings House is4,000sqftandyour office is1,000sqft.And your rentis4,000/mo . 25% or1,000/mo isdeduction .Which is12,000/yr Xtheincome taxrate. Savings Ranges Depends onthesquare footage ofyour house andtheamount ofyour rentand mortgage payment .Limited tonetincome. Preparation, Planning, orImplementation Preparation, Planning Applicable Years Current andFuture Years Sources Reg.Section 1.62-2(d)(1),IRCSection 121, Reg.Sections 1.121-1(e)(1)and1.121-1(e)(4 ),IRC Section 121(d)(6 ),IRCSection 1(h)(1)(E), Rev.Proc.2005- 146 Strategy: Travel Expenses Description Business travel isallowed forseveral reasons forbusiness owners .Often business owners arereluctant totake travel related todeductions forbusiness orareunaware that with some simple strategies, they can deduct travel combined withvacation. Travel forNew Business .Traveling toidentify new locations, potential M&A orto acquire new investment property isalldeductible business travel .Travel toand from thelocation, inaddition tocosts (lodging, Uber, etc.)ondays thatbusiness ormeetings areconducted arealldeductible . Conferences &Seminars .Travel toattend conferences and seminars isalso deductible, andvacations canoften betacked onto these trips.Travel toand from the location forthe participants isdeductible, asislodging for conference/seminar nights .However, non-business and non-conference days arenotdeducitble. Board Meetings .Board meetings inresort locations canbedeductible withclear business purpose andareason forwhy they cannotbeheld atthebusiness primary location. Forexample: enticement forboard members toattend. Travel costs forspouses andchildren aretypically non-deductible, however, if they areinvolved inthebusiness andhave abusiness purpose forattending, the travel may bedeductible. For example, achild who functions as videographer fortheCEO andtravels forthatpurpose would bedeductible . Sources IRCSection 162(a)(2 );T.J.Enterprises, Inc.vCommr .,101TC581; Welch vHelvering, 290U.S.111; Barry vCommr .,54TC1210, aff’d 435F.2d 1290; United Title Insurance Co.,TCMemo 1988- 38;Jackson vCommr .,TCMemo 1975 -301; IRCSection 274(h)(7 );Danville Plywood Corp .v U.S.,899F.2d3;Blackshear vCommr .,T.C.Memo 1977- 231 Robinson vCommr .,T.C.Memo 1963- 209; Reg.Section 1.274-5T(b)(2 ).CalculationTravel Costs x Tax RateSavings Ranges Depends on the costs of travel Beware of luxury limits Preparation, Planning or Implementation Preparation, PlanningApplicable Years Prior, Current and Future Years 7 Strategy: Meal Categories Description 50Percent Deductions : ● Lunch withcustomer, client oremployee associated withabusiness discussion ● Taxes andtipsrelating toameal orentertainment activity ● Room rental foradinner orcocktail party (assuming theevent metthebusiness relation test) 100Percent Deductions : ● Transportation costs toandfrom abusiness meal orentertainment activity, may be100percent deductible or50percent depending onthefacts. ● Meals provided ontheemployer’s premises fortheemployer’s convenience, if more than 50percent oftheemployees arefurnished meals fortheemployer’s convenience ● Promotional activities thataremade available tothegeneral public ● Employer -provided social/recreational expenses primarily forthebenefit of employees who arenothighly compensated, such asasummer picnic or holiday party ● Business gifts upto$25toanyoneindividual pertaxyear Nondeductible Items : ● Lunch withcustomer, client oremployee without abusiness purpose/discussion ● Ticket price forsporting event thatyoudonotattend ● Club dues ;forexample, country clubs, golfandathletic clubs ● Lavish orextravagant entertainment expenses (basically unreasonable expenses) ● Under TCJA, entertainment deductions areeliminated .Based onIRSguidance issued Oct3,2018, meals willcontinue tobedeductible. Sources code sec.274(e)(4 );IRCSection 119(a).; IRCSection 132(e)(2 ).;IRCSection 274(n)(2 )(B). Reg.Section 1.119-1(a)(2).;Reg.Section 1.119-1(a)(1).;Reg.Section 1.119-1(a)(2)(iii). Reg.Section 1.119-1(a)(2)(i).;IRCSection 119(b)(4 );IRSReg.1.119-1(a)(2)(ii)(e) 50percent rule.;IRCSection 274(n).; FSA 200031003.; IR-2018- 195 IRSNotice 2018- 76Calculation 50% or 100% of cash paid for meals depending on the type.Savings Ranges 50-100% deduction X income tax rate. Preparation, Planning or Implementation Preparation, PlanningApplicable Years Current and Future Years 8 Strategy: Hiring Children & Grandparents Description Sole-proprietors and spousal partnerships can pay children upto$12,000 without incurring any taxneither income norpayroll forlegitimate services rendered tothebusiness based onamarket rateofpay.SandCcorporations andnon-spousal partnerships canalso take advantage ofthisstrategy ;however they arenotexempt from payroll taxes, social security and Medicare. The business cantake thededuction forthepayandonthechild’s taxreturn. Ifitis lessthan thestandard deduction, thereby reducing taxable income tozero. CalculationTaxRate xSavings Savings Ranges TaxRate x$12,000x#ofchildren employed Preparation, Planning, orImplementation Preparation, Planning Applicable Years Current andFuture Years Sources IRCSection 151(d)(5 )2018, IRCSection 63(c)(7 )2018, Rev.Proc.2016- 55 IRCSection 3121(b)(3 )(A); Reg.Section 31.3121(b)(3 )-1,IRCSection 3306(c)(5 )9 Strategy: Maximize Depreciation Description Normal Depreciation. Confirm assets are properly capitalized and being depreciated. Many times thisisnotbeing done properly oratallbytheir current accountant .Forexample, arecent client owned acommercial building thatwas notcapitalized orbeing depreciated, and theaccountant had only therental operations onthebooks . Expense. The IRS allows forexpensing items under certain limits, likesmall tools and equipment .The business sets areasonable policy forcapitalization limits, then expenses individual items under thatlimit.Forexample, ifaclient establishes $1,000 asthelimit and buys acomputer for$800,thecomputer would beexpensed rather than depreciated. Bonus Depreciation. Inorder toqualify forpercent bonus depreciation, the original useoftheproperty must begin with thetaxpayer andtheproperty must be: 1)Modified Accelerated Cost Recovery System (MACRS) property with a recovery period of20years orless, 2)depreciable computer software, 3)water utility property, or4)qualified leasehold improvement property .Certain acquisition requirements andplaced inservice dates must also bemetinorder toqualify for30,50,or100percent bonus depreciation, andarediscussed in more detail below . Section 179.Similar toBonus Depreciation, Section 179allows fullexpensing of acquired assets (uptocertain limits) .Most equipment, furniture &fixtures (MACRS property) qualifies forSection 179treatment . (Cost Segregation -Covered inAdvanced Strategies) Sources IRCSection 167; IRCSection 168; IRCSection 179; IRCSection 461CalculationCorrect Ordering (Bonus/Sec 179/Regular)Savings Ranges $3,000- unlimited, though there are limits on bonus and S -179 Preparation, Planning or Implementation Preparation, PlanningApplicable Years Previous, Current and Future Years 10 Strategy: Health Care Strategies Description 2%orgreater S-Corp shareholders can either bereimbursed forhealth insurance premiums ortheS-Corp candirectly payhealth insurance premiums . Under either method, theS-Corp can deduct thecost.The amount paid for health premium must beincluded inW-2earnings fortheshareholder, exempt from FICA .Shareholder then deducts thepremiums on1040 asself-employed health insurance deduction. Partners inapartnership may also elect thesame treatment forinsurance premiums ;however premiums must beincluded asGuaranteed Payments since partners should notbepaid salary orwages from apartnership they own. Sole-proprietors canpayforanddeduct insurance premiums ontheir 1040 as self-employed health insurance deduction. CalculationTaxRate xTotal Premiums Savings Ranges TaxRate xTotal Premiums Preparation, Planning, orImplementation Preparation, Planning Applicable Years Current andFuture Years Sources Notice 2008- 1.IRCSection 162(l)(2 )(B). ,IRCSection 162(l)(5 ). Notice 2008- 1.,IRCSection 4980H(c)( 2),which defines alarge employer ashaving 50ormore employees .Notice 2017- 20.IRCSection 162(a); Reg. Section 1.162-10(a). IRCSection 105(b). Notice 2008- 1.Notice 2011- 1.Rev.Proc.2014- 41.Notice 2015- 1711 Strategy: Fringe Benefits Description Disability Insurance: Taxable, butexempt from FICA &Unemployment Group Term Life:upto$50,000forregular, non-shareholder employees Qualified Moving Expenses :eliminated under TCJA Qualified Transportation Costs :taxable andsubject toFICA forshareholder Qualified Dependent Care :total benefit provided to>5%shareholders must be lessthan 25% orallbenefits toallparticipants aretaxable Working Condition Benefits :corporate car, smartphone &service, jobrelated education DeMinimus Benefits :useofcompany copy machine, small gifts, occasional parties &picnics, occasional theatre orsporting events NoAdditional Cost Benefits :useofbenefits from points andmiles programs Qualified Employee Discount Programs Sources IRCSection 1372; Rev.Rul.91-26.,IRCSection 1372. ,IRCSections 1372(b); 318(a)(1 ).,IRCSections 105; 106; 162(l); IRSNotice 2008- 1;IRS Announcement 92-16.,IRCSection 125(d)(1 )andProp .Reg.Section 1.125-1(g)(2 ).The Scorporation shareholder -employee who owns more than 2percent isnotanemployee forSection 125purposes .Participation intheSection 125plan byanon-employee negates theplan andmakes ittaxable forallparticipants .IRCSection 4980D ;IRSNotices 2008- 1and2015- 17.,IRCSection 4980B(b)(1 ). Notice 2005- 8.,Rev.Rul.58-90;Rev.Rul.91-26;Announcement 92-16;Fact Sheet 2008- 25.,IRSPub. 15-B,Employer’s TaxGuide toFringe Benefits (2018), Dated Feb.22,2018, p.Pub. Law 115-97,Sections 11048; 11049; H.Rpt.115-466, p.278.,IRSPub. 15-B,Employer’s TaxGuide toFringe Benefits (2017), Dated Dec.16,2016, p.,IRSPub. 15-B,Employer’s TaxGuide toFringe Benefits (2018), Dated Feb.22,2018, p.21., IRCSection 119.,IRSPub. 15-B,Employer’s TaxGuide toFringe Benefits (2018), Dated Feb.22,2018, p.8.,IRCSections 74(c) 2018; 274(j) 2018. ,IRSPub. 15-B,Employer’s TaxGuide toFringe Benefits (2018), Dated Feb.22,2018, p.13.,IRCSection 23;see2017 Instructions for Form 8839, Qualified Adoption Expenses, dated Jun. 22,2017. ,IRCSection 137.,IRCSection 127(b)(3 ).,IRCSection 129(d)(4 ).,IRCSection 132(d) 2018. ,IRCSection 67(g). ,IRSPub. 15-B,Employer’s TaxGuide toFringe Benefits (2018), Dated Feb.22,2018, p.21.,IRCSection 132(e) 2018. ,IRSPub. 15-B,Employer’s TaxGuide toFringe Benefits (2018), Dated Feb.22,2018, p.9.,IRCSection 132(b) 2018. ,IRSPub. 15-B, Employer’s TaxGuide toFringe Benefits (2018), Dated Feb.22,2018, p.19.,IRCSection 132(c) 2018. ,IRSPub. 15-B,Employer’s TaxGuide to Fringe Benefits (2018), Dated Feb.22,2018, p.11.Calculation Tax Rate x SavingsSavings Ranges Depends on the fringe benefits available and selected by client, but could range from several hundred to tens of thousands Preparation, Planning or Implementation Preparation, PlanningApplicable Years Current and Future Years 12 Strategy: Accountable Plans Description Anaccountable plan allows employees, andinthiscase owner employees, to bereimbursed forexpenses paid out ofpocket .The expenses become deductions tothebusiness and theemployee oremployee- owner can be reimbursed, creating non-taxable cash flowtothem .Inorder forthisplan tobea “Qualified Accountable Plan” itmust have thefollowing connection points : -Business Connection -Substantiation (Expense Reports -withreceipts) -NoExcess Payments -Timeliness (30-DayRule) Ifnotdisbursed under anaccountable plan, thepayments totheemployees could beconsidered additional wages bytheIRS. Examples :mileage, auto, home office, travel, meals &entertainment .Consider using amobile applikewww. mileiq .com toaidindocumentation. CalculationAdditional Expenses xTaxRate Expense Report done within 30Days ofexpense Savings Ranges $2,000-$10,000 Preparation, Planning, orImplementation Preparation, Planning Applicable Years Current andFuture Years Sources Treas .Reg.1.62-2;IRCSection 3306(b)13 Strategy: Medical Reimbursement Plan Description There aremultiple medical reimbursement plan strategies available tosmall businesses. They range intheir ability tocreate taxsavings .Each Medical Plan hasdifferent rules andyouMUST follow them inorder toqualify fortherules : IRCSection 125-Pre-taxdeduction thatisstilltheBEST way todeduct employee paid Group Health Insurance from apaycheck .Italso allows forGroup Term Lifeplans, FSA’s (Flexible Spending Accounts), andelective defined contribution plans . IRCSection 105Plan (HRA) -Normally done withaSchedule CorSMLLC .Itcanbedone with aFamily Management Company .Viable if:a)business employs atleast oneemployee (can be aspouse), b)are over 25,and c)reasonable compensation ispaid (benefits apply to compensation) .The following expenses qualify :premiums paid from spouse W-2(other job), Long Term Care Ins,anymedical expense onForm 1040, orSpecial Needs Child Expenses . HSA -Medical savings account fortaxpayers thathave ahigh deductible .This account cangrow taxdeferred, similar toanIRA.Contributions aretaxdeductible andqualified distributions are taxfree.Unlike anFSA, anHSA does notgotozero attheend ofeach year and unused contributions canbecontinually rolled over tohelp fund retirement . QSEHRA -Qualified Small Employer Health Reimbursement Account -Company funded account thatallows forreimbursement ofmedical expense ifhealth insurance isnotoffered by theemployer .This reimbursement canbeconsidered aspart oftheemployee’s compensation package. Reimbursements areflexible and have amax contribution amount .The benefit is shown onForm W-2inbox12,code FF. IRCSection 401(h) -Aretirement plan with amedical twist.Theaccount isattached toaCash Balance Plan (defined benefit plan) thatisoffered bytheemployer .Itisfunded with pre-tax dollars, grows taxdeferred, allows fortaxfree qualified withdrawals and also allows fortax bracket shifting opportunities . Calculation Qualified Contributions xTax RateSavings Ranges $2,000-$100,000+ Preparation, Planning or Implementation Preparation, PlanningApplicable Years Current and Future Years Sources IRCSection 125; IRCSection 105; IRCSection 3306(c)(5 );IRCSection 3121(b)(3 )(A); IRC Section 223(a); IRCSection 4980(H)(c)(2 );2107 Form W-2 Instructions14 Strategy: Home Administrative Office Description Business owners who have abusiness location outside oftheir home, butalso maintain ahome administrative office forrunning thebusiness canclaim the home office astheir primary office .Asaresult, allmileage forbusiness purposes from thehome office isdeductible, including trips tooffice(s) outside ofthehome. CalculationTaxRate xMileage Rate xEstimated Mileage Savings Ranges $500-$7,500 Preparation, Planning, orImplementation Preparation, Planning Applicable Years Prior, Current andFuture Years Sources IRCSection 280A(c)(1 )15 LEGAL ENTITY OPTIMIZATION 16 Strategy: Schedule C To S -Corp Description Asole-proprietor operating with anLLC can elect tobetreated asanS- corporation fortaxpurposes .Bymoving operations offoftheindividual’s tax return, the15%self-employment taxiseliminated onearnings upto$128,400 and 2.9%onincome greater than $128,400. S-corporation shareholders are required toreceive reasonable compensation (RC) from theS-corp.Savings calculation isbased ondifference between RCand income upto$128,400 times 15% and2.9%ondifference above $128,400. Calculation15% forthe amount between the annual salary and the limits onself employment taxof$128,400 Savings Ranges 3,000-15,000+ Preparation, Planning, orImplementation Planning, Implementation Applicable Years Current andfuture years Sources IRCSection 1361- 136317 Strategy: S-Corp To C -Corp Description Inabusiness where substantial profits arebeing reinvested intothebusiness rather than being distributed toowners, aC-Corporation structure may bemore beneficial .Under TCJA, corporate income taxrates areaflat21%where individual taxrates onpass -through income arelikely much higher .The tax savings calculation willbethedifferential between theindividual owner taxrates andthecorporate taxrate. CalculationThedifference intheindividual’s taxrateandthetaxrateof21%assuming no dividends during theperiod Savings Ranges $5,000-Unlimited Preparation, Planning, orImplementation Planning, Implementation Applicable Years Current andfuture years Sources IRCSection 351-36818 Strategy: Late S Elections Description The IRS facilitates thegrant ofrelief tolate-filing entities byconsolidating numerous other revenue procedures intoonerevenue procedure andextending relief incertain circumstances .This procedure provides guidance forrelief for late: Scorporation elections Electing Small Business Trust (ESBT) elections Qualified Subchapter STrust (QSST) elections Qualified Subchapter SSubsidiary (QSub) elections Corporate classification elections which theentity intended totake effect onthe same date thattheScorporation election would take effect. Generally, therelief under therevenue procedure can begranted when the entity failstoqualify solely because itfailed tofiletheappropriate election under Subchapter Stimely with theapplicable IRSCampus andallreturns reported income consistently asiftheelection was ineffect. Please note that for purposes ofthis guidance, the“effective date” isthedate theelection is intended tobeeffective . Calculation 15% fortheamount between the annual salary and the limits onselfemployment tax of$128,400Savings Ranges $3,000-$15,000+ Preparation, Planning or Implementation PlanningApplicable Years Retrospective and Current Year Sources Rev.Proc.2013- 30; IRSReference: www. irs.gov/businesses/small -businesses -self-employed/late- election- relief19 RETIREMENT PLANNING 20 Strategy: Profit -Sharing Retirement Plan Description Aprofit sharing plan isatype ofdefined contribution plan thatletscompanies help employees save forretirement .With aprofit sharing plan, contributions from theemployer arediscretionary .That means thecompany candecide from year toyear how much tocontribute (orwhether tocontribute atall)toan employee’s plan.Ifthecompany does nothave aprofit, itdoes nothave to make contributions totheplan.(But acompany does notneed tobeprofitable tohave aprofit -sharing plan.)This flexibility makes itagreat retirement plan option forsmall businesses orbusinesses ofanysize. Calculation Themaximum contribution amount foraprofit sharing plan isthelesser of25% ofcompensation or$55,000in2018 Savings Ranges TaxRate atContribution Preparation, Planning, orImplementation Planning, Implementation Applicable Years Youmay need topartner withafinancial advisor Sources IRC, DOL, ERISA, andothers21 Strategy: Traditional 401(k) Description A401(k) plan isaqualified employer -sponsored retirement plan that eligible employees may make salary -deferral contributions toonapost-taxand/or pretax basis .Employers offering a401(k) plan may make matching ornon- elective contributions totheplan onbehalf ofeligible employees andmay also addaprofit -sharing feature totheplan.Earnings ina401(k)plan accrue ona tax-deferred basis . CalculationThe maximum contribution amount fora401(k)is$18,500,plus acatch -up contribution forthose 50andolder of$6,000foratotal max of$24,500 Savings Ranges TaxrateatContribution Preparation, Planning, orImplementation Planning, Implementation Applicable Years Current and Future YearsSubcontractorYoumay need topartner withafinancial advisor . Sources IRC401k22 Strategy: Roth 401(k) Description ARoth 401(k)isanemployer -sponsored investment savings account that is funded with post-taxmoney uptotheplan’s contribution limit.This type of investment account iswell-suited topeople who think they willbeinahigher tax bracket inretirement than they arenow. CalculationThecontribution limit forindividuals in2018 is$18,500peryear.Individuals 50 andolder cancontribute anadditional $6,000in2018 asacatch -upcontribution Savings Ranges TaxrateatContribution Preparation, Planning, orImplementation Planning, Implementation Applicable Years Current and Future Years SubcontractorYoumay need topartner withafinancial advisor . Sources IRC401k23 Strategy: Cash Balance Plan Description Acash balance pension plan isapension plan inwhich anemployer credits a participant’s account with asetpercentage ofhisorheryearly compensation plus interest charges .Acash balance pension plan isadefined benefit plan.As such, theplan’s funding limits, funding requirements and investment riskare based ondefined -benefit requirements :aschanges intheportfolio donotaffect the final benefits tobereceived bythe participant upon retirement or termination, thecompany solely bears allownership ofprofits andlosses inthe portfolio. Calculation The maximum contribution varies byage, butistypically much higher than a 401(k) oraProfit -sharing plan Savings Ranges TaxrateatContribution Preparation, Planning, orImplementation Planning, Implementation Applicable Years Current and Future YearsSubcontractorYoumay need topartner withafinancial advisor Sources 411(a)(7 )(A)(i), 411(a)(7 )(A)(ii), 41224 Strategy: Self-Directed Retirement Funds Description Aself-directed individual retirement account (SDIRA) isanindividual retirement account (IRA) inwhich theinvestor isincharge ofmaking alltheinvestment decisions .The self-directed IRAprovides theinvestor with greater opportunity forasset diversification outside oftraditional stocks, bonds, andmutual funds . Self-directed IRAs caninvest inrealestate, private market securities andmore . Allsecurities and investments are held inanaccount administered bya custodian ortrustee . CalculationAnnual individual contributions totraditional IRAs cannot exceed $5,500inmost cases. Ifyou’re 50orolder, youcancontribute upto$6,500 peryear using catch -upcontributions . Savings Ranges TaxrateatContribution Preparation, Planning, orImplementation Planning, Implementation Applicable Years Current and Future YearsSubcontractorYoumay need topartner withafinancial advisor Sources IRC40825 Strategy: 412(e)(3) Plans Description Ina412(e)(3 )plan, each participant isprovided with aguaranteed, pre- determined benefit amount that isdefined bytheplan document and fully insured bythepurchase offixed annuity orlifeinsurance andannuity contracts . Because plan benefits areguaranteed, 412(e)(3)plans areexempt from the funding requirements ofIRC Section 41.Any “excess” interest earnings (or dividends, ifpaid) over andabove thelifeandannuity contract guarantees are used toreduce thenext year’s plan contribution . Calculation Thecalculations arecomplex anddepend upon ageandincome Savings Ranges TaxrateatContribution Preparation, Planning, orImplementation Planning, Implementation Applicable Years Current and Future Years Subcontractor Youmay need topartner withafinancial advisor Sources IRC40826 Strategy: Defined Benefit Plans Description Adefined benefit pension plan isatype ofpension plan inwhich an employer/sponsor promises aspecified pension payment, lump -sum on retirement thatispredetermined byaformula based ontheemployee’s earnings history, tenure ofservice andage, rather than depending directly onindividual investment return CalculationContributions toadefined benefit plan arebased onwhat isneeded toprovide definitely determinable benefits toplan participants .Actuarial assumptions and computations arerequired tofigure these contributions . Savings Ranges TaxrateatContribution Preparation, Planning, orImplementation Planning, Implementation Applicable Years Current and Future YearsSubcontractorYoumay need topartner withafinancial advisor Sources 411(a)(7 )(A)(i), 411(a)(7 )(A)(ii)27 Strategy: 412(e)(3) Plans Description Ina412(e)(3 )plan, each participant isprovided with aguaranteed, pre- determined benefit amount that isdefined bytheplan document and fully insured bythepurchase offixed annuity orlifeinsurance andannuity contracts . Because plan benefits areguaranteed, 412(e)(3)plans areexempt from the funding requirements ofIRC Section 41.Any “excess” interest earnings (or dividends, ifpaid) over andabove thelifeandannuity contract guarantees are used toreduce thenext year’s plan contribution . Calculation Thecalculations arecomplex anddepend upon ageandincome Savings Ranges TaxrateatContribution Preparation, Planning, orImplementation Planning, Implementation Applicable Years Current and Future Years Subcontractor Youmay need topartner withafinancial advisor Sources 412(e)(3 )28 INSURANCE 29 Strategy: Captive Insurance Description ACaptive Insurance Company isaninsurance company established with the specific objective ofinsuring risks emanating from their parent group .This isan alternative form ofrisk management that isbecoming amore practical and popular means through which companies can protect themselves financially while having more control over how they areinsured. Inessence, abusiness canchoose topaytaxdeductible premiums toitsown Captive, instead ofa3rd party, saving itself theprofit margin thatwould otherwise have tobepaid tothat 3rdparty .Benefits include savings tothebottom lineaswellasareduction in risk exposure resulting from more targeted coverage. Inaddition, many Captives have developed intoprofit centers with reserves thataccumulate tax free when premiums areinexcess ofclaims, and when excess reserves are pulled outoftheCaptive they aretaxed atCapital gains rates rather than ordinary income rates . Sources IRC831(b) Domicile Regulated, UPS vsCommissioner ofIRSCalculation Maximum annual premium paid intoaCaptive Insurance Company is$2.3mfor2018. The premiums paid aretax deductibleSavings Ranges 10-50% ofcurrent premium Preparation, Planning or Implementation Planning, ImplementationApplicable Years Current and Future Years SubcontractorYou may need topartner withafinancial advisor 30 LEGAL LOOPHOLES 31 Strategy: Augusta Loophole Description The IRSallows abusiness owner torenttheir primary residence oravacation home totheir business forupto14non-consecutive days each year.The residence can belocated anywhere intheUnited States and theincome is excluded from taxable income fortheresidence owner /business owner . The rental isestablished with alease agreement between thebusiness and residence owner, with pricing supported byresearching and documenting comparable space forasimilar event . CalculationEstablished Rental Price xTaxRate Savings Ranges $1,000-$9,000 Preparation, Planning, orImplementation Planning, Implementation Applicable Years Current andFuture Years Sources PLR 8104117; IRC Section 280A(c)(6 );IRC Section 274(a)(1 )(B); IRC Section 280A(d)(2 );IRC Section 267(a)(2 );IRCSection 262; IRC Section 162; Gregory vHelvering, 293U.S.465(1935 );Frank Lyon Co.vUnited States, 435U.S.561, 573(1978) ;IRCSection 280A(g); IRCSection 274(e)(4 );IRC Section 274(n)(2 )(A); IRCSection 280A(d)(2 )(A); IRCSection 267(a)(2 )(A); IRCSection 280A;Rev.Rul.76-287; Leslie A.RoyvCommr .,TCMemo 1998- 125PLR 810411732 Strategy: QEAAP Description Qualified Plan forEmployee Achievement Award program -Anachievement award thatisgiven under anestablished written plan thatdoes notdiscriminate towards highly paid employees .Normal awards are$400peremployee, butcan beasmuch as$1,600ifanemployee isgiven multiple awards ortheindividual awards aregreater than $400.Awards arenormally given based offoflength of service byanemployee. Owner -employees ofS-Corps donotqualify forthistax break .The award must begiven intheform ofatangible asset andnotcash . Theemployee canchoose their award aslong asthecost does notexceed the maximum. Calculation Award Value x#ofEmployees xTaxRate Savings Ranges $1,000-$3,000 Preparation, Planning, orImplementation Planning, Implementation Applicable Years Current andFuture Years Sources 26USC §274(j)(3 )(B)(i)33 NICHE STRATEGIES 34 Strategy: 1031 Exchange Description Allows theexchange oflikeproperty with indefinite deferral ofgains resulting from thedisposition oftheproperty being sold. Exchange isamisnomer andthe transaction isthecombination ofasale oftheoriginal property combined with theacquisition ofanew, likeproperty .However, both thesale andacquisition must beconducted through aqualified intermediary forthetransactions to qualify under Section 1031 .Once thesale ismade (through theintermediary), thetaxpayer then has45days toidentify new property and180days toexecute thetransaction (also through theintermediary) .The TCJA eliminated many classes ofproperty from 1031 exchange; however, allrealestate stillqualifies . Taxcanbetriggered ifcash isreceived ordebt isreduced asaresult ofthe exchange. Calculation Cap Gains TaxRate xGain onSale Savings Ranges $3k-Unlimited Preparation, Planning, orImplementation Planning, Implementation Applicable Years Current andFuture Years Sources Reg.Section 1.1031, Private Letter Ruling 8118023, PLR 200842019, IRCSection 453(f)(6 ),Revenue Procedure 2000- 3735 Strategy: Cost Segregation Description When abuilding isacquired, rather than justcapitalizing thebuilding andland asassets, acost segregation study canbeperformed toidentify other classes ofassets within thebuilding .Forexample, personal property items likecarpet, light fixtures, kitchen appliances, landscaping, driveways, sidewalks, decks, etc. canbebroken outtoshorter class lives (5,7&15years) .Theshorter asset life classes canuseaccelerated depreciation, and may also qualify fortreatment under bonus depreciation and Section 179.Compared tostraight line depreciation at27.5or39years onthebuilding, acost segregation study can create significant taxsavings intheearlier years oftheownership ofthe building.Properties with values great than $500,000willneed acost segregation study completed byanengineering consulting firm that specializes inpreparing the studies .Software isavailable forcost segregation studies onresidential rental properties valued at$500,000orless. CalculationAdditional Depreciation (including bonus &179) xTaxRate Savings Ranges $10,000-$100,000+ Preparation, Planning, orImplementation Planning, Implementation Applicable Years Prior, Current andFuture Years SubcontractorConsider using www. kbkg .com. Sources Reg.Section 1.446-1T(e)(5 )(iii);IRCSection 168(k); Rev.Proc.2002- 19,Section 2.02(2);Rev.Proc.2002- 9,Section 6.02(7);Rev.Proc.2006- 12,Section 5.04modifying Rev.Proc.2002- 9,Section 4.02(6)36 Strategy: Passive Real Estate Losses Description Passive real estate losses (from investments) can help offset income from active real estate professionals, taxpayers with less than $150,000 taxable income (MFJ) or$75,000(single), andtaxpayers withpassive income. CalculationTaxRate xAllowable Losses Savings Ranges Limits depend onincome phase outs andprofessional status Preparation, Planning, orImplementation Planning, Implementation Applicable Years Current andFuture Years Sources IRSPublication 92537 Strategy: FICA Tip Credit Description The TipTax Credit isacredit that equal tothesocial security and Medicare taxes paid onthetipsreceived bytheemployees .Thebusiness canclaim this credit .Nocredit isgiven fortipsused tomeet thefederal minimum hourly wage rate.Abusiness cannot claim both thecredit AND theexpense deduction. Ifthe business claims thecredit, they must reduce social security andMedicare tax deductions accordingly .The credit reduces taxliability dollar fordollar and passes through topartners orshareholders ofpartnerships andScorporations . Calculation%ofW-2Wage Savings Ranges $2,000-$8,000 Preparation, Planning, orImplementation Planning, Implementation Applicable Years Prior, Current andFuture Years Sources IRCSection 45b38 Strategy: Research & Development Tax Credit Description The Research &Experimentation TaxCredit orR&D TaxCredit isageneral business taxcredit forcompanies thatincur research anddevelopment (R&D) costs intheUnited States .Inorder toqualify, they must : ● BeTechnological inNature ● BeUsed foraPermitted Purpose ● Involve theElimination ofUncertainty ● Involve aProcess ofExperimentation Only certain direct andindirect expenses willqualify forthecredit .Inorder toclaim the credit, itmust beonatimely filed taxreturn (including extensions) andcanoffset either income taxes orpayroll taxes . Thefollowing industries seetheR&D Credit themost (this isnotanallinclusive list) ● Manufacturing &Fabrication ● Software Development ● Engineering ● Architecture ● LifeSciences &Pharmaceutical ● Machining ● Aerospace &Defense ● Food Science ● Tool &DieCasting ● Foundries ● Automobile ● Chemical &Formula Sources IRCSec41(a) -(h)Calculation %ofQualified ExpensesSavings Ranges 10-50% ofcurrent premium Preparation, Planning or Implementation Planning, ImplementationApplicable Years Prior, Current and Future Years 39 Strategy: Self Employed Health Insurance Premium Credit Description SelfEmployed Health Insurance Premium Credit wascreated byTheAffordable Care Act toencourage and benefit small employers who provide health coverage fortheir employees .Itisalso known asThe Small Business Health Care Tax Credit .Toqualify, theemployer must have less that 25fulltime employees, employees must have average wages of$50,000 (adjusted for inflation), and the employer must pay aportion ofhealth insurance for employees .Currently thiscredit isonly available foruptotwoyears, isclaimed against income tax,andisclaimed onForm 8941. Calculation%ofHealth Inspaid, <25employees, upto50% ofpremiums Savings Ranges $2,000-$8,000 Preparation, Planning, orImplementation Planning, Implementation Applicable Years Current andFuture Years Sources IRCSection 36b;Notice 2010- 8240 Strategy: Work Opportunity Tax Credit Description TheWork Opportunity TaxCredit isaFederal taxcredit available toemployers forhiring individuals from certain target groups who have consistently faced significant barriers toemployment .You must survey anemployee when you hiretheemployee (Prescreen), then youmust fileForm 8850 timely .Thelast step isforyoutotake thecredit onyour income taxes (this does notoffset payroll taxes) .Theindividuals qualified fortheWOTC areasfollows : ●Families onFood Stamps ●Families withLTorSTTemp Assistance (with dependents) ●Qualified Veterans ●Qualified Ex-Felons ●Individuals Completing Vocational Rehab programs ●Empowerment Zone Youths ●Limited Unemployment Recipients Calculation%ofW-2wages forQualified Employees Savings Ranges $2,000-$8,000 Preparation, Planning, orImplementation Planning, Implementation Applicable Years Present -12/31/2019 Sources IRCSection 51;Form 8850 Instructions41 ADVANCED STRATEGIES 42 Strategy: Deferred Compensation Description Deferred compensation isanarrangement inwhich aportion ofanemployee’s income ispaid outatalater date after which theincome wasearned. Examples ofdeferred compensation include pensions, retirement plans, and employee stock options . CalculationCompensation Deferred xTaxRate Savings Ranges $1,000-Unlimited Preparation, Planning, orImplementation Planning, Implementation Applicable Years Current andFuture Years Sources IRCSection 457b43 Strategy: Tax Loss Harvesting (Investments) Description Taxloss harvesting isthepractice ofselling asecurity thathasexperienced a loss. Byrealizing, or“harvesting” aloss, investors areable tooffset taxes on both gains andincome. CalculationCapital Gains TaxRate xOffset Income Savings Ranges $3,000-Unlimited (toextent ofgains) Preparation, Planning, orImplementation Planning, Implementation Applicable Years Current andFuture Years Sources IRCSection 1211, IRCSection 122244 Strategy: Conservation Easements Description Aconservation easement isaninvestment inaqualified private land conservation organization orgovernment toconstrain, astoaspecified land area, theexercise ofrights otherwise held byalandowner soastoachieve certain conservation purposes CalculationQualified investors cancontribute upto50% oftheir AGI.Thetaxcalculation is complex andvaries from project toproject Savings Ranges 90-120% ofcurrent tax Preparation, Planning, orImplementation Preparation, Planning Applicable Years Current Year SubcontractorYoumay need topartner withafinancial advisor Sources IRC170(h), IRC1.170A -1445 Strategy: Cooperatives Description Whereas cooperatives ingeneral areheld liable forfederal income taxes but can deduct patronage dividends from their gross income fortaxpurposes, certain specified types ofcooperative organizations enjoy anoriginal exemption from income taxliability . Calculation20% xTaxRate xSales toCo-op Savings Ranges $1,000-Unlimited Preparation, Planning, orImplementation Preparation, Planning Applicable Years Current andFuture Years Sources IRCSection 10146 Strategy: Family Office Management Company Description Foramore active family wealth planning structure, establish aseparate family office management company which contracts with thevarious family holding companies andoperating businesses .Income from themanagement contracts isrevenue tothemanagement company which, inturn, canbeconverted into salaries, benefits, and business expenses forfamily members invarying tax brackets . Calculation0-100% deduction xincome taxrate Savings Ranges 0-100% depending onrelative income taxrates anddeductibility ofexpense Preparation, Planning, orImplementation Preparation, Planning Applicable Years Current andFuture Years SubcontractorYoumay need topartner withanattorney Sources Code Section 162 TheLender’s Bagels Case (Lender Management, LLC v.Commissioner)47 Strategy: Revenue Stream Bifurcation Description There canoften beadvantages inseparating revenue streams into different entities .Forexample, under theTCJA, certain services arenotfavored (such as accountants) .However, payroll does notfallinthat category .Splitting payroll revenue intoitsown company could have thebenefit ofincrease theSection 199a deduction. CalculationDepends onStructure &Stacked Benefits Savings Ranges $1,000-Unlimited Preparation, Planning, orImplementation Preparation, Planning Applicable Years Current andFuture Years Sources Code Section 162 TheLender’s Bagels Case (Lender Management, LLC v.Commissioner)48 Strategy: Charitable LLCs Description ACLLC isaphilanthropic strategy whereby thedonor funds anLLC with a certain amount ofassets anddonates asignificant portion oftheLLC units toa qualified charitable organization .Thedonor receives acharitable taxdeduction equal tothefairmarket value ofthedonated LLC units .Additionally, anyincome generated bytheassets transferred intotheLLC willbereported proportionally bythemembers, which means asignificant majority oftheLLC’s income willbe reported bythe tax-exempt charitable organization. The client generally maintains significant control over theday-to-dayoperations oftheLLC andmay elect tomanage theassets accordingly .Due tothedual taxbenefit, thisstrategy works best when funded withhighly appreciated assets. CalculationACLLC isacomplex planning strategy andcalculation thatshould bedone with anexperienced TaxAttorney Savings Ranges Upto99% ofcapgains taxwithtaxfreegrowth ofassets Preparation, Planning, orImplementation Preparation, Planning Applicable Years Current Year SubcontractorYoumay need topartner withafinancial advisor Sources IRC170, USvMichael LMyer49 Strategy: Freeze Transactions With GRATs And IDGTs Description Inaddition tousing one’s lifetime exemption (currently $11.18M),taxpayers can achieve significant gifting leverage through the use ofvarious “freeze transactions .”Inparticular, taxpayers can giftassets toaGrantor Retained Annuity Trust (“GRAT”), orsellassets toanIntentionally Defective Grantor Trust (“IDGT”). Ineach structure, thesettlor ofthetrust retains anincome stream inanamount equal totheinitial value oftheasset transfer .Since the retained benefit equals theamount transferred, thenetvalue ofthetransfer is $0,and therefore there isnogift.Consequently, thevalue oftheasset is “frozen” with respect tothetransferor’s estate, and allappreciation thereon inures tothebenefit ofthetransferee. Such transfers canbefurther leveraged through theuseoffamily LLC interests andvaluation discounts . Calculation40% ofthediscount andappreciation oftheassets inthetrust Savings Ranges 40% ofthediscount andappreciation oftheassets inthetrust Preparation, Planning, orImplementation Preparation, Planning Applicable Years Current andFuture Years SubcontractorYoumay need topartner withanattorney Sources Code Sections 671, 2702, 7520 Chapter 14Special Valuation Rules50 EXIT & CAPITAL GAINS 51 Strategy: Installment Sales Description Aninstallment sale coupled with amonetization loan, [allowing theseller] to take advantage oftaxdeferral ontheasset sale, which isapermitted result under I.R.C.§§453and453A . CalculationAnInstallment Sale isacomplex planning strategy andcalculation thatshould bedone withanexperienced specialist . Savings Ranges Time value ofmoney Preparation, Planning, orImplementation Preparation, Planning Applicable Years Current orFuture Years SubcontractorYoumay need topartner withafinancial advisor Sources IRC45352 Strategy: Deferred Gains -DST Description TheDeferred Sales Trust isalegal contract between youandathird-party trust inwhich yousellrealorpersonal property orabusiness totheDeferred Sales Trust inexchange fortheDeferred Sales Trust’s contractual promise topayyou acertain amount over apredetermined future period oftime intheform ofan installment sale note orpromissory note. Itisoften referred toasa“self-directed note” because youhave control over theterms ofthenote. TheDeferred Sales Trust gives you the ability tocontrol your capital gains tax exposure, reinvestment terms, andinstallment payments made from thetrust. CalculationCapital Gains Rate xAvoided Gain Savings Ranges $1,000-Unlimited Preparation, Planning, orImplementation Planning orImplementation Applicable Years Current andFuture Years Sources IRCSections 1031 Rev.Rul.2004- 8653 Strategy: QSBS Election Description QSBS isstock inaCcorporation thatmeets theconditions ofbeing aqualified small business corporation (QSBC) .Rules applying toQSBS were created to urge investment incertain small businesses byallowing investors the opportunity toavoid taxonsome oralloftheir gain from thedisposition of QSBS. Calculation Capital Gains Rate xAvoided Gain Savings Ranges $1,000-Unlimited Preparation, Planning, orImplementation Planning, Implementation Applicable Years Possibly Prior, Current andFuture Years Sources IRCSection 120254 Strategy: ESOP / ESOT Description Anemployee stock ownership plan (ESOP) oremployee stock option trust (ESOT) isanemployee- owner program that provides acompany’s workforce with anownership interest inthecompany .InanESOP, companies provide their employees with stock ownership, often atnoupfront cost tothe employees .ESOPs have anumber ofsignificant taxbenefits, themost important ofwhich isthatcontributions ofstock aretax-deductible. That means companies cangetacurrent cash flow advantage byissuing new shares or treasury shares totheESOP. CalculationCapital Gains Rate xAvoided Gain Savings Ranges $1,000-Unlimited Preparation, Planning, orImplementation Planning, Implementation Applicable Years Current andFuture Years Sources IRCSection 401(a)55 Strategy: ESOPs Description AnESOP isatype ofqualified, defined contribution plan designed toinvest primarily inthestock ofthesponsoring employer .ESOPs are“qualified” inthe sense that theESOP’s sponsoring company, theselling shareholder and participants receive various taxbenefits .ESOPs areoften used asacorporate finance strategy tocreate aliquid marketplace forclosely held stock which provides aviable taxadvantaged exitstrategy forshareholders under Section 1042. Acommon misconception isthatbyinstalling anESOP anowner hasto give upcontrol oftheir company totheir employees, which isn’t thecase .A properly structured ESOP allows anowner tosellsome oralloftheir privately held stock, creating liquidity, while still maintaining 100%control ofthe company . CalculationEmployer contributions totheESOP generally aretax-deductible uptoalimit of 25% ofcovered payroll (this limit also includes employer contributions toother defined contribution plans) . Savings Ranges Thesaving ranges ofESOPs vary andanESOP specialist should beconsulted oneach specific situation. Preparation, Planning, orImplementation Preparation, Planning Applicable Years Current andFuture Years SubcontractorYoumay need topartner withafinancial advisor Sources IRCSection 401(a)56 GIFT & ESTATE PLANNING 57 Strategy: Charitable Remainder Trusts Description Acharitable remainder trust isa“split interest” gifting vehicle thatallows youto make contributions tothetrust andbeeligible forapartial taxdeduction, based ontheCRT’s assets that willpass tocharitable beneficiaries .You canname yourself orsomeone else toreceive apotential income stream foraterm of years, nomore than 20,orforthe lifeofone ormore non-charitable beneficiaries, andthen name oneormore charities toreceive theremainder of thedonated assets. CalculationCapital Gains Rate xAvoided Gain Savings Ranges $1,000-Unlimited Preparation, Planning, orImplementation Planning, Implementation Applicable Years Current andFuture Years Sources IRCSection 664(d)(2 );IRCSections 664(d)(1 )and453(b); Reg.1.664-2(b)]Reg.1.664-3(b) IRCSection 170(b)(1 )(A); IRCSection 170(d)(1 )(A); Regs .20.2031- 7A(f); 1.664-458 Strategy: Family Trusts Description Afamily trust, sometimes called afamily trust fund, isalegal device used to avoid probate, avoid ordelay taxes, andprotect assets. Revocable Trust .This type oftrust allows thegrantor tocancel, orrevoke, the trust.Ifitisrevoked, theassets aretransferred back tothegrantor .Ofcourse, once thegrantor dies, thetrust becomes irrevocable .Arevocable trust ismost often used toavoid probate. Irrevocable Trust .This type oftrust precludes thegrantor from getting thetrust assets back, unless the trustee and the beneficiaries agree .The trust agreement willclearly state thatitisirrevocable. Irrevocable trusts also avoid probate, andareused togain additional benefits, such astoavoid taxes, protect assets from creditors, orallow thegrantor toqualify forcertain public benefits (such asMedicaid) . CalculationCapital Gains Rate xAvoided Gain Savings Ranges $1,000-Unlimited Preparation, Planning, orImplementation Planning, Implementation Applicable Years Current andFuture Years Sources IRCSection 672-67559 TAX CUTS & JOBS ACT 60 Strategy: Section 199A Description Section 199AoftheInternal Revenue Code provides many taxpayers adeduction for qualified business income from aqualified trade orbusiness operated directly or through apass -through entity .Thededuction hastwocomponents . Eligible taxpayers may beentitled toadeduction ofupto20percent ofqualified business income (QBI) from adomestic business operated asasole proprietorship or through apartnership, Scorporation, trust orestate .Fortaxpayers withtaxable income thatexceeds $315,000foramarried couple filing ajoint return, or$157,500forallother taxpayers, thededuction issubject tolimitations such asthetype oftrade orbusiness, thetaxpayer’s taxable income, theamount ofW-2wages paid bythequalified trade or business and theunadjusted basis immediately after acquisition (UBIA) ofqualified property held bythetrade orbusiness .Income earned through aCcorporation orby providing services asanemployee isnoteligible forthededuction. Eligible taxpayers may also beentitled toadeduction ofupto20percent oftheir combined qualified realestate investment trust (REIT) dividends andqualified publicly traded partnership (PTP) income. This component ofthesection 199Adeduction isnot limited byW-2wages ortheUBIA ofqualified property . The sum ofthese two amounts isreferred toasthecombined qualified business income amount .Generally, this deduction isthelesser ofthecombined qualified business income amount and anamount equal to20percent ofthetaxable income minus thetaxpayer’s netcapital gain.The deduction isavailable fortaxable years beginning after Dec.31,2017 .Most eligible taxpayers willbeable toclaim itforthefirst time when they filetheir 2018 federal income taxreturn in2019 .The deduction is available regardless ofwhether anindividual itemizes their deductions onSchedule A ortakes thestandard deduction. Calculation See entity selector spreadsheetSavings Ranges $3,000 -No fixed cap (unlimited) Preparation, Planning or Implementation PlanningApplicable Years Current and Future Years Sources IRCSections :199A(b) ;199A(e)(2 );99(e)(2 )(A); 199A(b)(3 );199A(d)(3 );199(e)(2 )(A); 199A(b)(3 );199A(d)(3 ); 199A(b)(3 )(A); 199A(b)(2 );199A(b)(3 )(A); 199A(d)(3 )(A)61 Strategy: C-Corp Tax Rate Description Inthenew TaxCuts andJobs Act, theC-Corp taxrate isdown from 35% to 21%. CalculationThe difference intheindividuals taxrate andthetaxrate of21% assuming no dividends during theperiod Savings Ranges UnlimitedPreparation, Planning, orImplementation Planning, Implementation Applicable Years Current andFuture Years Sources IRCSection 13001(a)62 Strategy: Opportunity Zone Credit Description Opportunity Zones aredesigned tospur economic development byproviding tax benefits toinvestors .First, investors candefer taxonanyprior gains until the earlier ofthedate onwhich aninvestment issold orexchanged, orDecember 31,2026, solong asthegain isreinvested inaQualified Opportunity Fund . Second, iftheinvestor holds theinvestment intheOpportunity Fund foratleast tenyears, theinvestor would beeligible foranincrease inbasis equal tothefair market value oftheinvestment onthedate that theinvestment issold or exchanged. Calculation Gains Invested inQOZF xCapital Gains TaxRate Savings Ranges UnlimitedPreparation, Planning, orImplementation Planning, Implementation Applicable Years Current andFuture Years Sources TCJA, IRCSection 1400Z -263 Strategy: Favorable Depreciation Rules Description -Section 179: increase limitto$1,000,000from $510,000 -Section 179: expansion ofqualified improvement property -Section 179: now includes lodging furnishings -Bonus Depreciation :increased to100% from 50% (first year) -Bonus Depreciation: eliminates distinction between qualified restaurant, leasehold improvement andretail property . CalculationAdditional Depreciation xTaxRates Savings Ranges Uptospecific asset acquisition limits Preparation, Planning, orImplementation Preparation, Planning Applicable Years Prior, Current andFuture Years Sources IRCSection 179(f)(1 )2018, IRCSection 179(f)(2 )2018, IRCSec.179(d)(1 )2018, IRCSec.179(b)(3 )64 Strategy: Non-Grantor Trusts And Section 199A Description Theinclusion ofnon-grantor trusts incorporate planning structures hasbecome more attractive under thenew TaxCuts andJobs Act(“TCJA”). Specifically, the income limitations under 199A forcertain flow-through entities create an incentive tohave multiple owners under the$157,500 income threshold to benefit from a20% deduction onqualified business income. CalculationFederal andstate income taxratex20% xqualified business income (States may vary onQBID treatment) Savings Ranges Upto20% offederal andstate income tax Preparation, Planning, orImplementation Preparation, Planning Applicable Years Current Year andFuture Years SubcontractorYoumay need topartner withanattorney Sources Code Section 199A65 Strategy: Non-Grantor Trusts And Section 1202 Description Theinclusion ofnon-grantor trusts incorporate planning structures hasbecome more attractive under thenew Tax Cuts and Jobs Act(“TCJA”). Specifically, withitsnew 21% flattaxrate, theCCorporation hasbecome more attractive for business owners .Consequently, Section 1202, which only applies toC Corporations and affords taxpayers a100% exclusion oncapital gains, will become more prevalent asaprivate business ownership strategy .Section 1202 allows taxpayers toavoid capital gains taxupto$10M foraqualified trade or business .Forbusinesses expecting again inexcess ofthese amounts, non- grantor trusts canbeused tocreate multiple shareholders, each ofwhich are entitled totheir own separate $10M exemption. Calculation20% ofrealized gain Savings Ranges Upto20% offederal andstate income tax Preparation, Planning, orImplementation Preparation, Planning Applicable Years Current Year andFuture Years SubcontractorYoumay need topartner withanattorney Sources Section 120266 Strategy: C Corps And The “GILTI” Tax Description Under theTaxCuts andJobs Act,certain shareholders offoreign corporations must include allGlobal Intangible Low-Tax Income (“GILTI”) intheir income, regardless ofwhether itisdistributed intheform ofdividends .This haschanged thelandscape forcontrolled foreign corporations which used tobenefit from deferral ofincome byoperating outofno-orlow-taxjurisdictions .Toreduce such tax,adomestic CCorporation canbelayered intorepatriate theforeign income andbenefit from a50% Dividends Received Deduction .Inorder forthe provision toapply, thetaxpayer must own 10% ormore oftheforeign corporation. Calculation Federal andstate income taxx50% xdividends received Savings Ranges Results inaneffective taxrateof10.5%ondividends received Preparation, Planning, orImplementation Preparation Planning Applicable Years Current Year andFuture Years SubcontractorYoumay need topartner withanattorney Sources Code Sections 957&245A67 Strategy: C Corps And FDII Description Toprevent theproliferation ofoffshore intellectual property holding companies, theTaxCuts andJobs Actcreated anincentive tokeep intellectual property in theU.S.andlicense theintellectual property abroad. Specifically, through the useofaCCorporation holding company, licensed intellectual property which creates Foreign Derived Intangible Income (“FDII”) isentitled toa37.5% deduction ofallsuch income forthetaxyears 2018 -2025. After 2025, theFDII deduction willbereduced to21.875% . CalculationFederal andstate income taxx37.5%(2018- 2025) Federal andstate income taxx21.875% (after 2025) Savings Ranges Effective rateuntil 2025 =13.125% Effective rateafter 2025 =16.406% Preparation, Planning, orImplementation Preparation, Planning Applicable Years Current Year andFuture Years SubcontractorYoumay need topartner withanattorney Sources Code Section 25068 ASSET PROTECTION 69 Strategy: Family Limited Liability Company (“FLLC”) Description Establish afamily limited liability company toown various family investment assets. The FLLC canbeimplemented forboth taxandnon-taxbenefits .Tax benefits include shifting ofincome tofamily members inlower taxbrackets, offsetting offamily gains with family losses intheaggregate, offsetting of income withexpenses, andminimization ofestate taxthrough discounted gifting and asset freeze techniques .Non-taxbenefits include asset protection, centralization ofownership and management, ease ofgifting, retention of wealth, andrearing ofdescendants . CalculationIncome tax:10-100% xincome taxrate Estate tax:40-60% xvalue ofgifting LLC interests andallappreciation thereon Savings Ranges Income tax:10-100% depending onrelative income taxrates, deductibility of expense, andavailability ofgains andlosses Estate tax:40-60% xvalue ofgifting LLC interests andallappreciation thereon Preparation, Planning, orImplementation Preparation, Planning Applicable Years Current Year andFuture Years SubcontractorYoumay need topartner withanattorney orvaluation expert Sources Code Sections 162, 2036, 2701- 2704 70 Strategy: Exempt Asset Planning With ERISA Plans Description ERISA Plans afford ataxpayer theopportunity toplace significant assets inan asset -protected, tax-deferred vehicle, which also has thebenefit ofavoiding probate. Maximizing defined contribution plans (such as401(k)Plans), andfor older clients, defined benefit plans (such as“Cash Balance Plans”), allows for significant pre-taxallocations ofincome with tax-deferred growth inavehicle thatisexempt from thereach ofcreditors . CalculationContribution amount xindividual’s federal andstate taxrate Savings Ranges 10-37% +state tax Preparation, Planning, orImplementation Preparation, Planning Applicable Years Current Year andFuture Years SubcontractorYoumay need topartner withanattorney forplan anddocuments andafinancial advisor forasset management Sources Code Sections 401&40371 Strategy: Exempt Asset Planning With Private Placement Life Insurance (“PPLI”) Description Life insurance can beused asatax-efficient portfolio management tool in addition todeath benefit planning .Properly formed, lifeinsurance cangrow tax- free, allow fortax-freeloans, andavoid income taxupon thereceipt ofadeath benefit .Inaddition, inmost states, lifeinsurance canbeexempt from thereach ofcreditors initsentirety oraportion thereof .With respect tohigh networth clients, aspecial form ofinsurance known asPrivate Placement LifeInsurance hasbeen established toserve asalow-cost, tax-freeportfolio wrapper .Ineffect, PPLI can convert atax-inefficient portfolio into atax-free portfolio with a corresponding death benefit .PPLI canalso bestructured toescape estate tax, aswell, through theuseofanIrrevocable LifeInsurance Trust and/or afully- gifted family limited liability company .Foreign PPLI canbeuseful forU.S.and non-U.S.taxpayers when combined with anoffshore asset protection trust.For U.S.taxpayers, this provides superior asset protection, and fornon-U.S. taxpayers, thisisavery effective pre-immigration planning tooltoavoid taxation onworldwide income. CalculationPortfolio earnings xfederal andstate income taxrate-policy expenses Savings Ranges 10-37% +state tax Preparation, Planning, orImplementation PlanningApplicable Years Current Year andFuture Years Subcontractor Youmay need topartner withanattorney forplan anddocuments andaninsurance advisor Sources Code Sections 7701 &817(h)72 Strategy: Exempt Asset Planning With Private Placement Variable Annuities (“PPVA”) Description AVariable Annuity canbeused asatax-efficient portfolio management toolin addition toaretirement planning vehicle .Properly formed, theinvestment assets inaVariable Annuity cangrow tax-free and canbeexempt from the reach ofcreditors .With respect tohigh networth clients, aspecial form of annuity known asaPrivate Placement Variable Annuity hasbeen established to serve asalow-cost, tax-free portfolio wrapper .Ineffect, PPVA canconvert a tax-inefficient portfolio intoatax-freeportfolio .Aforeign PPVA canbeuseful for U.S.andnon-U.S.taxpayers when combined with anoffshore asset protection trust.ForU.S.taxpayers, thisprovides superior asset protection, andfornon- U.S.taxpayers, thisisavery effective pre-immigration planning tooltoavoid taxation onworldwide income. CalculationPortfolio earnings xindividual federal and state income taxrate -policy expensesSavings Ranges 10-37% +state tax Preparation, Planning, orImplementation PlanningApplicable Years Current Year andFuture Years SubcontractorYoumay need topartner withanattorney forplan anddocuments andaninsurance/annuity advisor Sources Code Sections 7702 &817(h)73 Strategy: Offshore Asset Protection Trust (“OAPT”) Description Forclients seeking thehighest form ofasset protection anddiversification away from theU.S.,anOffshore Asset Protection Trust affords themost protective asset protection laws available forhigh networth clients .There arenoinherent taxbenefits toanOAPT, andbydefinition, anOAPT settled byaU.S.taxpayer istreated asagrantor trust.However, OAPTs arecommonly combined with Private Placement Life Insurance (“PPLI”) and Private Placement Variable Annuities (“PPVA”) toestablish afully asset -protected andtax-free investment structure .Implementation ofanOAPT carries with itannual foreign compliance anddisclosure requirements . CalculationN/Aunless combined withPPLI andPPVA Savings Ranges N/Aunless combined withPPLI andPPVA Preparation, Planning, orImplementation Planning Applicable Years Current Year andFuture Years SubcontractorYoumay need topartner withanattorney (Lawyer Foreign Trustee) Sources Code Sections 671, 678, 67974 INTERNATIONAL 75 Strategy: Puerto Rico Act 20 & 22 Description Inorder topromote exportation ofservices, formation ofnew businesses, and relocation ofU.S.taxpayers toPuerto Rico, Acts 20&22provide significant corporate andpersonal taxexemptions onincome .Specifically, theprovisions ofAct20&22provide foraflat4%corporate taxrate and a100%tax exemption onprofits, dividends, property taxes, and capital gains .Inorder to qualify forthese exemptions, anindividual must beabona fideresident, andthe business must bealegitimate trade orbusiness with local employment .Strict rules apply forsuch qualifications . CalculationAct20:81-100% xcorporate taxrate Act22:100% xincome, dividends, andcapital gains ;90% xproperty taxes Savings Ranges Act20:81-100% Act22:90-100% Preparation, Planning, orImplementation Preparation, Planning Applicable Years Current Year andFuture Years SubcontractorYoumay need topartner withanattorney Sources Puerto Rico Act20 Puerto Rico Act2276 Strategy: U.S. Virgin Islands EDC Program Description Inorder topromote business, investment, and residency intheU.S.Virgin Islands, theEconomic Development Commission (“EDC”) created thefollowing U.S.Virgin Islands taxbenefits :90% deduction inboth corporate andpersonal income tax,and 100%exemption onlocal gross receipts, business property, andexcise taxpayments, among other economic benefits .Inorder toqualify for these benefits, thetaxpayer must beabona fideresident, present intheU.S. Virgin Islands inexcess of183days . CalculationFederal andstate income taxx90% Savings Ranges 90%Preparation, Planning, orImplementation Preparation, Planning Applicable Years Current Year andFuture Years SubcontractorYoumay need topartner withanattorney Sources Code Sections 934&93677 OTHER STRATEGIES 78 Strategy: Cost Remediation Description Using cost remediation orcost procurement strategies, companies canmaintain their competitive edge byreducing operational cost and corporate risk to improve profit performance. During cost remediation/cost procurement studies, specialists willconsider anumber ofitems tolower operating costs such as manufacturing incentives, vendor screening, energy deregulation, equipment lease audits, freight andparcel audits, hiring incentives, taxcredits, cellphone audits, energy comprehensive studies, workers compensation audits, property lease audits, etc. CalculationThere isnotaximplication ofcost remediation, butitisagreat strategy to increase thebottom linerevenue. Savings Ranges 10-30% ofcurrent costs Preparation, Planning, orImplementation Preparation, Planning Applicable Years Current Year andFuture Years SubcontractorYoumay need topartner withafinancial advisor Sources Code Sections 934&93679"}
{"text": "Income Tax Saving Strategies for Business Owners Bernstein Private Wealth Management 2A wide array of income tax saving options are available to business owners with the luxury and foresight to plan—provided they know where to look. The optimal strategy depends not only on the business owner’s goals and objectives, but on obtaining expert advice well before a deal is on the table. In part, the “right” approach depends on the circumstances. For instance, business owners who live in high-income-tax-rate states can avoid state tax by establishing a specialized trust in a jurisdiction with no income tax. What’s more, business owners may sidestep $10 million or more of otherwise taxable gain for federal tax purposes (and potentially state income tax purposes as well1) if their ownership interest is qualified small business stock (QSBS) within the meaning of Section 1202 of the Internal Revenue Code.2 In this paper, we’ll explore both of these strategies in detail, as they tend to be underappreciated relative to their considerable tax-saving potential. 1 Not all states conform to Section 1202 which will still result in a state income tax liability on the sale of QSBS. As of this writing, California, Pennsylvania, New Jersey, Alabama, and Mississippi do not conform, while Hawaii and Massachusetts partially conform to Section 1202. 2 Within the meaning of Section 1202 of the Internal Revenue Code of 1986, as amended (hereinafter, “IRC”). Income Taxes: State of Play Before diving in, note that income tax rates differ substantially from state to state. Some states—including Massachusetts, Utah, and Illinois—levy a flat income tax while others—Florida, Texas, and Nevada, for example—impose no state income tax at all. New Jersey and California, among others, have marginal percentage rates in the double digits, while others set their taxes at quite modest levels, comparatively speaking ( Display 1 ). DISPLAY 1: STATE INCOME TAXES DIFFER SIGNIFICANTLY FROM STATE TO STATE Top Marginal State Individual Income Tax Rates (as of January 1, 2022) Note: Map shows top marginal rates: the maximum statutory rate in each state. This map does not show effective marginal tax rates, which would include the effects of phase-outs of various tax preferences. Local income taxes are not included. Missouri’s top marginal rate will be reduced to 5.3% if certain revenue triggers are met. *State has flat income tax. **State only taxes interest and dividend income. Source: Bloomberg BNA; Tax Foundation; state tax statutes, forms, and constructions. To mitigate state income taxes, some entrepreneurs may consider relocating to a lower-tax state. But changing one’s tax domicile can be complicated, and the requirements vary state-by-state. And another option—qualified retirement plans or individual retirement accounts (IRAs)—generally disallow ownership interests in one’s closely held business.Instead, some entrepreneurs with deals in sight might consider an incomplete gift nongrantor (ING) trust. When properly implemented, this strategy eliminates state income taxes on sale proceeds, but it isn’t for everyone. Ultimately, its appeal rests on careful structuring and a thorough understanding of the trade-offs. Let’s explore in further detail. Bernstein Private Wealth Management 3 DINGs, WINGs, and NINGs Among the zero-income-tax states where an ING trust might be established are Delaware (DING), Nevada (NING), and Wyoming (WING). While these acronyms might sound like silverware hitting the floor, they’re actually powerful tools for an eventual business exit. Whichever the jurisdiction, business owners can use these strategies to secure substantial state income tax savings—provided the trust is properly structured.3 How do ING trusts work? First, a business owner living in a high-tax- rate state (other than New York4) establishes a nongrantor trust—one that’s treated as a separate taxpayer for income tax purposes—in a state that does not tax the trust’s retained income (e.g., Delaware, Nevada, Wyoming, Tennessee). Notably, the trust must have two essential features: •The gift must be “incomplete” so that the entrepreneur is treated as owning the trust assets for estate and gift tax purposes, and •The trust must be a “nongrantor trust” so that the entrepreneur isn’t treated as owning the trust assets for income tax purposes. This combination allows the grantor to achieve a favorable state income tax outcome without making a taxable gift ( Display 2 ). DISPLAY 2: “INCOMPLETE” NONGRANTOR (ING) TRUSTS HINGE ON WHAT YOU OWN “Incomplete” Grantor owns trust assets for estate and gift tax purposes “Nongrantor” Grantor doesn’t own trust assets for income tax purposes Trust Powers: Knowing When to Hold or Fold To ensure the transfer to the trust will be considered incomplete for gift tax purposes, the grantor must reserve sufficient power over the transferred assets. Typically, the grantor will retain a power to direct the trustee to distribute the trust’s assets to others.5 If properly structured, the mere existence of this “limited power of appointment” will make the grantor’s gift to the trust incomplete. Relinquishment of the grantor’s power of appointment would complete the gift; for that reason, in most cases, the power will remain in effect during the grantor’s lifetime. For income tax purposes, limitations on the grantor’s ability to receive distributions of trust assets help ensure qualification as a nongrantor trust.6 Among other provisions, the trust instrument typically will prohibit any distribution to the grantor without consent of a “distribution committee” consisting of a subset of, or all, current beneficiaries. If the trust meets both requirements—the gift to the trust is incomplete, but the trust is not a grantor trust—then undistributed trust income should avoid state income tax, while distributed income will be subject to income tax in the beneficiary’s home state. Either way, an ING trust is still subject to federal income tax (whether income is accumulated in the trust or distributed to beneficiaries). And, if income is accumulated, the trust must pay those federal income taxes under highly compressed trust tax brackets. Bernstein Private Wealth Management 43 Trust income tax laws vary from state to state, so state income tax savings may not be achieved in every situation. For example, some states assert the right to tax a trust forever if the grantor was a resident of that state at the time the trust became irrevocable. 4 New York treats an ING trust established by a resident as a grantor trust for state income tax purposes; other states, including California, are considering similar legislation. 5 Treas. Reg. Sec. 25.251 1-2(b). 6 See Sections 671-679 of the Internal Revenue Code. Scenario A Scenario B Scenario C Scenario D Assumptions •No tax planning prior to the sale •One spouse gives $10 million of their business interest to an ING trust prior to the sale •One spouse gives $10 million of their business interest to nongrantor trust, in a tax-favored state, prior to the sale as a completed gift •One spouse gives $10 million of their business interest to a SLAT for the benefit of the other spouse and their descendants Strategy •Sell the business for $30 million •Pay a $9 million income tax liability* •Reinvest the remaining $21 million in an 80%/20% portfolio of global stocks and bonds •Riveras personally receive $14 million, net of federal, state, and local tax •ING Trust receives $7.63 million, net of just federal tax† •Saves $620,000 in state and local income taxes •Riveras personally receive $14 million, net of federal, state, and local tax •Nongrantor trust receives $7.63 million, net of just federal tax† •Saves $620,000 in state and local income taxes •Trust assets will be excluded from the Riveras’ taxable estate as neither spouse is a beneficiary of the trust •The SLAT essentially reverses the tax effects of the ING trust •Grantor is treated as owner for federal, state, and local income tax purposes, but not for estate and gift tax purposes •Riveras pay the entire $9 million tax liability from the sale •Receive $1 1 million personally and $10 million in the SLAT *Taxes were calculated assuming all $30 million will be subject to a 30% tax rate (20% federal long-term capital gain plus a 10% state rate). As the Riveras were active owners, they were not subject to the 3.8% net investment income tax. †As the trustee of the ING would not generally be an active owner of the business, we assumed that the proceeds the ING received would be subject to the 3.8% net investment income tax, in addition to a 20% long-term capital gains tax.Case Study: Exploring Exit Options Consider the Riveras, a 60-year-old couple planning to sell their business for $30 million. For our purposes, we’ll assume they live in a (fictional) state that imposes an income tax at a flat rate of 10%. Like many entrepreneurs, most of their wealth is tied up in their business. However, they have set aside $2.5 million in marketable investments, including a $1.5 million retirement account. While they enjoy living in their current state, the prospect of losing 10% (i.e., $3 million) of their sale proceeds to state and local taxes concerns them. The Riveras want to maximize their after-tax proceeds since they’ll rely on those funds to sustain their annual living expenses of $250,000, adjusted for inflation, over their lifetimes. Could an ING trust provide a meaningful tax benefit? Or would forgoing that income tax benefit and establishing a spousal lifetime access trust (SLAT) instead prove more effective? To answer these questions, let’s analyze four different scenarios: The results of our model surprised the Riveras ( Display 3 ). They can clearly sustain their lifestyle for 30 years, but in the absence of any planning, will likely owe significant estate taxes at the second death (Scenario A). Giving $10 million to an ING (Scenario B) achieves a somewhat better outcome by generating an immediate state income tax savings of $620,000. But that extra savings increases the size of their taxable estate, which drives their future estate tax liability higher. Conversely, a $10 million completed gift to a non-ING trust (Scenario C) not only saves them $620,000 in income taxes but also removes future growth of the trust’s assets from their estate for federal estate tax purposes. Bernstein Private Wealth Management 5 DISPLAY 3: THE NONGRANTOR TRUSTS CREATE AN IMMEDIATE INCOME TAX SAVINGS WHILE THE “COMPLETED” GIFT AND SLAT CREATE ESTATE TAX SAVINGS Projected Wealth—Year 30 (Nominal, USD Million)* Assuming Current Estate Tax Laws Out of Estate–$13.9 –$15.8–$7.8$46.1 $19.0$27.0 $13.4$29.9$29.9 $46.2$48.9$56.9 $46.1$59.6 Estate Tax§ING or CNG†SLAT‡ After-Tax EstateTotal Wealth Increase in Total Wealth$2.8 $10.8 $13.5Scenario A No PlanningScenario D $10 Mil. SLATScenario B $10 Mil. “Incomplete” NG (ING) TrustScenario C $10 Mil. “Completed ” NG (CNG) Trust  In Estate *Values assume initial assets of $2.5 million, pretax sale proceeds of $30 million in year 1 with a cost basis of zero and annual spending of $250,000, adjusted for inflation. All scenarios assume the assets are invested with an asset allocation of 80% global stocks and 20% bonds, and that all assets with the exception of the assets in the nongrantor trusts are subject to a state tax rate of 10%. Projections assumed the transaction was structured as a stock sale, not an asset sale, and that no state-sourced income from grantors home state was realized. †Assumes $10 million is transferred to an “incomplete” nongrantor trust (ING) or a “completed” nongrantor trust (CNG). In both cases, the trust will be structured where it will only pay federal taxes on the income generated by the trust. The CNG is a completed gift and is out of the grantor’s estate for estate tax purposes. ‡The SLAT is assumed to be funded with $10 million and that the grantor will pay the taxes on the trust for the first 20 years of the analysis, thereafter the trust will pay its own taxes. §Estate taxes were calculated assuming a federal rate of 40% and that the lifetime exemption sunsets back to $6.03 million per person, adjusted for inflation. It is assumed that one spouse used $10 million of their lifetime exemption to make the completed gift or to fund the SLAT in scenarios C and D. The values do not account for any benefit from a step-up in cost basis. Projections based on AB’s estimates of the range of returns for the applicable capital markets over the periods analyzed. Data do not represent past performance and are not a promise of actual future results or a range of future results. Bernstein does not provide tax or legal advice; investors should consult tax and legal professionals before making any decisions. See Notes on the Bernstein Wealth Forecasting System in Appendix for further details. Lastly, and perhaps unexpectedly, the SLAT (Scenario D) confers the greatest benefit of all: While the SLAT yields no income tax savings, the family’s wealth is significantly enhanced by shifting federal, state, and local income taxes from the trust to the Riveras personally. This depletes their estate and, in this case, completely eliminates their potential estate tax liability. The savings is mainly due to the grantor’s ability to pay the SLAT’s income taxes without those payments being treated as additional gifts to the trust for federal gift tax purposes.7 Without this income tax burden, the SLAT accumulates $16.3 million more wealth than the taxable trusts (Scenarios B and C) over a 30-year period. All in all, the family is better off by $13.5 million (29% more wealth) after 30 years compared to the “no planning” scenario. Bernstein Private Wealth Management 67 Rev. Rul. 2004-64, 2004-2 C.B. 7, 2004. An Optimal Solution? In general, establishing an ING trust makes the most sense when the grantor: •Lives in a high-income-tax-rate state; •Is in the top-marginal-income-tax bracket for federal income tax purposes; •Has already used her or his full federal gift and estate tax exclusion ($12.92 million in 2023); and •Has appreciated assets (like business interests) to contribute that would benefit from a step-up in cost basis at the grantor’s death. Before proceeding, there are several considerations that business owners and their professional advisors must weigh, including: 1. Availability : This strategy may not be legally available in the entrepreneur’s state of residence. Some states assert the right to tax tangible assets (e.g., real estate, businesses), notwithstanding ownership by an out-of-state trust. As mentioned previously, at least one state (New York) treats an ING trust established by a resident as a grantor trust for state income tax purposes. Other states may follow. 2. Trade-Offs : As the case study shows, an ING trust can provide substantial income tax savings on an initial sale, but (i) will require the trust to be taxed at extremely condensed federal income tax brackets on undistributed income; and (ii) will not provide any estate tax relief. 3. Oversight : An ING trust requires an individual or corporate trustee domiciled in the tax-favored state. A corporate trustee charges administration fees, which must be factored into the strategy’s net value. After sale of the business, the ING trust’s future federal income taxes may be mitigated by (i) distributing, rather than retaining, trust accounting income; and (ii) adopting tax-efficient investment strategies, such as tax-loss harvesting, and “wrapping” high-returning, tax-inefficient investments in one or more low-cost private placement life insurance (PPLI) policies. QSBS Can Also Lead to Big Savings Most entrepreneurs—whether they live in a high-state-income-tax- rate jurisdiction or not—place a high priority on reducing the tax burden of an eventual business sale. Yet, tax planning prior to a business sale can be complicated. The more lead time owners have before closing, the more options they can preserve. Those who own stock in a closely held C corporation should determine, at a minimum, whether their ownership interest meets the statutory definition of QSBS under Section 1202 of the Internal Revenue Code.Qualifying for QSBS: An “Exclusive” Club For stock to be considered QSBS ( Display ), it must be or have been: 1. Issued by a domestic C corporation 2. Granted by a company that conducts an “active” business for substantially all the owner’s holding period 3. Received when the aggregate value of the company’s gross assets was less than $50 million 4. Held for more than five years 5. Granted by a company that conducts a “qualified” business within the meaning of the statute. QSBS Eligibility at a Glance Corporate Structure Domestic C corporation only Active Trade or BusinessAny trade or business other than: •Service Business •Banking/Insurance/Leasing •Investment Management •Farming/Mining/Oil & Gas Extraction •Hotels/Motels/Restaurants Gross Assets Less than $50 million in gross assets between business formation and immediately after stock issuance Issuance •Stock must be issued when corporation is deemed a qualified small business •Stock must be issued directly from the company and received by a non-corporate taxpayer (e.g., individuals, pass-through entities, trusts) Source: AllianceBernstein (AB) Bernstein Private Wealth Management 78 See IRC § 1202(h)(1), (2)(A),(B). DISPLAY 4: HOW THE QSBS WILL BE “STACKED” WITH VARIOUS TRUSTS Based on a $30.0 Million Sale* $10.0 $10.0 $10.0 $10.0$10.0 $10.0 $10.0$10.0 $10.0 $10.0 SLAT RiverasCNGT Scenario A $10M QSBSScenario D $10M QSBS $10M INGT $10M SLAT Scenario B $10M QSBS $10M INGTINGT Scenario C $10M QSBS $10M INGT $10M CNGT Income Taxes on Sale$3.4 $0.0 $3.4 $6.8$20.0 Not Taxable Taxable *Values assume that the sale qualifies for QSBS tax treatment where the Riveras can exclude $10 million of gains. All non-eligible QSBS are subject to a 33.8% tax rate (23.8% federal + 10% state). It is assumed that the incomplete nongrantor trusts (INGT) and the completed nongrantor trust (CNGT) will also be able to exclude $10 million of proceeds from taxation but the spousal lifetime access trust (SLAT) will not avoid any income taxes. Bernstein Private Wealth Management 8assets—including any gain recognized on the sale of the business. As a result, the SLAT is not entitled to a separate $10 million QSBS exclusion. However, assets held in the SLAT will not be subject to estate tax at the grantor’s death, and the continuing obligation to pay income taxes on behalf of the trust and its beneficiaries will deplete the Riveras’ estate for estate tax purposes. Quantifying the Outcomes Upon seeing our analysis, the Riveras were taken aback when they compared the amount of sale proceeds subject to income tax under each scenario ( Display 4, top section of each bar). Scenario C, in particular, stood out. Multiplying the QSBS exclusion through nongrantor trusts provides immediate income tax savings on the sale— but Scenario C layered on an even more significant estate tax benefit by structuring the second nongrantor trust as a CNG trust. Essentially, by making both completed and incomplete gifts to nongrantor trusts, the couple can avoid all income tax arising from their exit.Even those with a working knowledge of QSBS may not fully appreciate its potential. For instance, with appropriate pre-transaction planning, exiting owners may qualify for additional $10 million exclusions. How? If a gift of QSBS is made to another taxpayer—such as a family member or perhaps a nongrantor trust—that stock retains its “original issuance” status and is therefore eligible for its own $10 million exclusion, assuming all other statutory requirements are met.8 As you are about to see, this ability to “stack” multiple QSBS exclusions can be a very powerful strategy. Multiplying the QSBS Exclusion Let’s revisit the Riveras, who “winged” their way to considerable state tax savings earlier. They still plan to sell their business for $30 million, but this time we’ll assume their company was structured as a C corporation—rather than a limited liability company taxable as a partnership—when it was first established. As they contemplate their goals, the couple remains intent on securing $250,000 of annual, inflation-adjusted spending while minimizing income and estate taxes. Since the Riveras structured their business as a C corporation, held their shares for more than five years, and met all other requirements of Section 1202, their stock qualifies as QSBS. That means they can exclude $10 million of gain from the sale of their business, netting them $3.4 million9 in tax savings. Could they do better? Our analysis explores several scenarios: •Scenario A : No additional planning; the Riveras exclude only $10 million of gain. •Scenario B : The couple gives a $10 million stake in their business to an ING trust. As a separate taxpayer, the ING trust should be entitled to its own $10 million QSBS exclusion, saving an additional $3.4 million in income taxes. Yet the “incomplete” nature of the gift means that the assets held in trust will still be subject to estate tax at the grantor’s death. •Scenario C : Mirrors Scenario B, except prior to the sale, the couple also makes a “completed” gift of $10 million worth of shares in the business to a separate nongrantor (CNG) trust. This hybrid strategy should shield all $30 million of gain from income tax. In addition, assets held in the CNG trust at the grantor’s death should avoid estate tax. •Scenario D : Mirrors Scenario B, except the Riveras also give $10 million to a SLAT. Because a SLAT is almost always a grantor trust, the grantor must pay all income taxes attributable to the SLAT’s 9 For purposes of this analysis, we assume that the Riveras reside in a state that conforms to IRC Section 1202 and that eligible gain avoids state income tax at a “flat” rate of 10%. 10 On several occasions, most recently in the Biden administration’s “greenbook” of Fiscal Year 2023 tax reform proposals, the Democrats have proposed to curtail or eliminate many of the estate planning benefits of grantor trusts, including, for example, a proposal to treat the grantor’s payment of income taxes on behalf of the trust and its beneficiaries as taxable transfers for federal gift tax purposes. See Department of the Treasury, General Explanations of the Administration’s Fiscal Year 2023 Revenue Proposals, at 42 (March 2022); cf. Rev. Rul. 2004-64, 2004-27 I.R.B. 7 (treating such payments as true obligations, not gifts). Bernstein Private Wealth Management 9DISPLAY 5: CONTINUING TO PAY TAXES ON THE SLAT DOES NOT OVERCOME THE BENEFIT OF MULTIPLYING THE QSBS EXCLUSION Projected Wealth After Estate Taxes—Year 30 (Nominal, USD Million)* –$16.0–$22.4–$16.5–$3.9$54.1 $23.2 $4.5$40.5 $40.5 $25.9$40.5 $56.1$63.7$85.5$82.0 $54.1 Estate Tax†CNGT After-Tax Estate Scenario A $10M QSBSScenario D $10M QSBS $10M INGT $10M SLAT Scenario B $10M QSBS $10M INGTScenario C $10M QSBS $10M INGT $10M CNGT SLAT INGT Increase in Total Wealth$9.6 $31.4 $27.9 In Estate Out of Estate *Values assume initial assets of $2.5 million, pretax sale proceeds of $30 million in year 1 with a cost basis of zero, and annual spending of $250,000, adjusted for inflation. All scenarios assume the assets are invested with an allocation of 80% global stocks and 20% bonds, and that all portfolio income would be subject to top marginal federal taxes and a state rate of 10%. “$10M QSBS” assumed the owner’s business qualifies for the IRS Section 1202 Qualified Small Business Stock (QSBS) election where $10 million of the gains can be excluded from federal taxes. In scenarios B, C, and D, we assumed the owner gave $10 million worth of the stock to an incomplete nongrantor trust (INGT) that would receive its QSBS exclusion. In scenario C, we assumed the owners gave $10 million to a completed nongrantor trust (CNGT) that would receive its own $10 million exclusion. In scenario D, we assumed the $10 million gift to the SLAT would not receive any income tax benefit from the sale, but we assumed the grantor will pay taxes on the trust each year of the analysis from their assets and if depleted, then INGT. †Estate taxes were calculated assuming a federal rate of 40% and that the lifetime exemption sunsets back to $6.03 million per person, adjusted for inflation. It is assumed that one spouse used $10 million of their lifetime exemption to fund the SLAT and the CNGT. The values do not account for any benefit from a step-up in cost basis. Projections based on AB’s estimates of the range of returns for the applicable capital markets over the periods analyzed. Data do not represent past performance and are not a promise of actual future results or a range of future results. Bernstein does not provide tax or legal advice; investors should consult tax and legal professionals before making any decisions. See Notes on the Bernstein Wealth Forecasting System in Appendix for further details.Did the SLAT (Scenario D) add any value? Perhaps surprisingly, not as much as the CNG trust ( Display 5). That’s because a SLAT provides no separate QSBS benefit. And at $85.5 million, the net assets the couple would have accumulated in 30 years under Scenario C exceed the $82.0 million in the SLAT (Scenario D) by about 4%—without having to rely on another three decades of favorable grantor trust laws.10CRUTs Help Overcome the Loss of Control Although the prospect of completely sidestepping income taxes appealed to the Riveras, they were uncomfortable making irrevocable gifts that could considerably restrict their use and enjoyment of the assets. Could these entrepreneurs capture an additional $10 million QSBS exclusion without forgoing future access? 11 The income tax charitable deduction is not the total amount contributed, but rather the present value of what is expected to pass to charity at the end of the noncharitable term of the trust. The present value calculation takes into account the value of the contributed assets, the discount rate (based on the applicable “Section 7520 rate”), and the noncharitable term of the trust (either a fixed term of years, or for lifetime trusts, a life expectancy table is used). See IRC §§ 664, 7520, and the applicable Treasury regulations thereunder. Bernstein Private Wealth Management 10One potential solution may be contributing $10 million of shares to a charitable remainder unitrust (CRUT). In exchange, the couple would receive an upfront income tax charitable deduction for a portion of the value contributed.11 They would also retain the right to receive a fixed percentage of the fair market value of the CRUT’s assets each year (a “unitrust” distribution) for a set term or for life. Since a CRUT is tax-exempt, the sale proceeds should not be taxed immediately. Instead, periodic distributions will be taxed to the Riveras based on certain “tiered” rules of accounting12 where the highest-taxed tranches are deemed to be paid out first. If the CRUT qualifies for a separate QSBS exclusion, $10 million of gain should avoid taxation. On the other hand, if the CRUT is not treated as a separate taxpayer for QSBS purposes, then that $10 million of deferred gain will be taxable to the Riveras over the noncharitable term, which could stretch over their joint lifetimes. This sounded compelling to the Riveras. They would retain access to the sale proceeds via distributions from the CRUT, while the CRUT may be eligible for its own $10 million exclusion. But since the CRUT pays only a fixed percentage each year, it will take time for those accumulated distributions to exceed the amount the couple would have amassed otherwise. How long? The answer depends on the trust term and payout percentage. DISPLAY 6: HOW LONG DOES IT TAKE FOR THE CRUT TO PROVIDE A BENEFIT? Accumulated Personal Wealth (USD Million, Nominal)* Current Tax Law—$10 million QSBS Contributed to CRUT $19.1 $12.5 Today 5 10 15 20 25 30$55.2 $54.7$55.6 $45.6  No CRUT  5-Year CRUT  10-Year CRUT  Life CRUT60.0 50.0 40.0 30.0 20.0 10.0 *Crossover is defined as the point at which one accumulates more personal wealth by creating the CRUT than by selling and diversifying without the CRT. It is assumed that all payouts received from the CRUT are reinvested in a taxable portfolio with an asset allocation of 80% global stocks and 20% bonds. All portfolio income is assumed to be subject to top marginal federal tax rates. The values above do not reflect the assets inside the nongrantor trust. The 5-year CRUT is modeled with a payout of 37.5%, the 10-year CRUT is modeled with a payout of 20.9%, and the Life CRUT is modeled with a payout of 9.3%. Values assume the CRUT is eligible to receive a $10.0 million QSBS exclusion. Based on Bernstein’s estimates of the range of long-term returns for the applicable capital markets. Data does not represent past performance and is not a promise of actual or range of future results. See Notes on the Bernstein Wealth Forecasting System in Appendix for further details. 12 IRC § 664(b); Treas. Reg. Section 1.664-1(d)(1) Bernstein Private Wealth Management 11If the CRUT qualifies as a separate taxpayer for QSBS purposes, we project that it will take roughly three years for a CRUT with a five- year term and a 37.5% unitrust payout to generate more personal wealth than our “No CRUT” base case ( Display 6 ). By comparison, it would take 13 years for a joint-life CRUT with a unitrust payout of 9.3% to surpass the personal wealth generated in our base scenario. Interestingly, the Riveras end up with nearly the same amount of wealth in 30 years—irrespective of the term—and nearly $10 million more than not using the CRUT at all. Clearly, the CRUT creates more wealth if it captures an additional $10 million exclusion that will be paid out over time. Although CRUTs are typically designed to stretch the payouts to maximize tax deferral, the opposite may hold true for QSBS-funded CRUTs since there is no (or substantially lower) realized gain to be deferred. The Riveras aim to qualify the recipient trust as a separate taxpayer for QSBS purposes, while receiving $10 million of tax-free income as quickly as possible.A note of caution: If the CRUT fails to qualify for a separate QSBS exclusion—or if future tax laws eliminate or reduce the QSBS benefit—a longer noncharitable term generally will prove more protective of the Riveras’ personal wealth. A needs-based analysis can help quantify the trade-offs, and thereby mitigate those risks. Entrepreneurs Have Options—If They Know Where to Look Business owners have multiple tax-saving alternatives available to them in advance of a sale, but most strategies require considerable lead time to analyze and put into effect. The best advice for any business owner contemplating an eventual sale is to involve professional advisors early in the process. Once those advisors gain a better understanding of the owner’s hopes and aspirations, they can build a custom plan that maximizes the proceeds of sale. Notes on the Bernstein Wealth Forecasting SystemSM 1. Purpose and Description of the Bernstein Wealth Forecasting System AB’s Wealth Forecasting Analysis is designed to assist investors in making their long-term investment decisions as to their allocation of investments among categories of financial assets. Our planning tool consists of a four-step process: (1) Client-Profile Input: the client’s asset allocation, income, expenses, cash withdrawals, tax rate, risk-tolerance level, goals and other factors; (2) Client Scenarios: in effect, questions the client would like our guidance on, which may touch on issues such as when to retire, what his/her cash-flow stream is likely to be, whether his/her portfolio can beat inflation long-term, and how different asset allocations might impact his/her long-term security; (3) The Capital-Markets Engine: our proprietary model that uses our research and historical data to create a vast range of hypothetical market returns, which takes into account the linkages within and among the capital markets, as well as their unpredictability; and finally (4) A Probability Distribution of Outcomes: based on the assets invested pursuant to the stated asset allocation, 90% of the estimated ranges of probable returns and asset values the client could experience are represented within the range established by the 5th and 95th percentiles on “box-and-whiskers” graphs. However, outcomes outside this range are expected to occur 10% of the time; thus, the range does not guarantee results or establish the boundaries for all outcomes. Estimated market returns on bonds are derived taking into account yield and other criteria. An important assumption is that stocks will, over time, outperform long bonds by a reasonable amount, although this is in no way a certainty. Moreover, actual future results may not meet AB’s estimates of the range of market returns, as these results are subject to a variety of economic, market and other variables. Accordingly, the analysis should not be construed as a promise of actual future results, the actual range of future results or the actual probability that these results will be realized. The information provided here is not intended for public use or distribution beyond our private meeting. Of course, no investment strategy or allocation can eliminate risk or guarantee returns. 2. Retirement Vehicles Each retirement plan is modeled as one of the following vehicles: Traditional IRA, 401(k), 403(b), Keogh, or Roth IRA/401(k). One of the significant differences among these vehicle types is the date at which mandatory distributions commence. For traditional IRA vehicles, mandatory distributions are assumed to commence during the year in which the investor reaches the age of 70.5. For 401(k), 403(b), and Keogh vehicles, mandatory distributions are assumed to commence at the later of (i) the year in which the investor reaches the age of 70.5 or (ii) the year in which the investor retires. In the case of a married couple, these dates are based on the date of birth of the older spouse. The minimum mandatory withdrawal is estimated using the Minimum Distribution Incidental Benefit tables as published on www.irs.gov. For Roth IRA/401(k) vehicles, there are no mandatory distributions. Distributions from Roth IRA/401(k) that exceed principal will be taxed and/or penalized if the distributed assets are less than five years old and the contributor is less than 59.5 years old. All Roth 401(k) plans will be rolled into a Roth IRA plan when the investor turns 59.5 years old to avoid Minimum Distribution requirements. Bernstein Private Wealth Management 12 3. Rebalancing Another important planning assumption is how the asset allocation varies over time. We attempt to model how the portfolio would actually be managed. Cash flows and cash generated from portfolio turnover are used to maintain the selected asset allocation between cash, bonds, stocks, REITs and hedge funds over the period of the analysis. Where this is not sufficient, an optimization program is run to trade off the mismatch between the actual allocation and targets against the cost of trading to rebalance. In general, the portfolio allocation will be maintained reasonably close to its target. In addition, in later years, there may be contention between the total relationship’s allocation and those of the separate portfolios. For example, suppose an investor (in the top marginal federal tax bracket) begins with an asset mix consisting entirely of municipal bonds in his/her personal portfolio and entirely of stocks in his/her retirement portfolio. If personal assets are spent, the mix between stocks and bonds will be pulled away from targets. We put primary weight on maintaining the overall allocation near target, which may result in an allocation to taxable bonds in the retirement portfolio as the personal assets decrease in value relative to the retirement portfolio’s value. 4. Expenses and Spending Plans (Withdrawals) All results are generally shown after applicable taxes and after anticipated withdrawals and/or additions, unless otherwise noted. Liquidations may result in realized gains or losses, which will have capital-gains tax implications. 5. Modeled Asset Classes The following assets or indexes were used in this analysis to represent the various model classes: Asset Class Modeled as: Annual Turnover Rate Municipal Cash Municipal money-market securities 100% Cash Equivalents 3-month Treasury bills 100% Intermediate-Term Diversified Municipals AA-rated diversified municipal bonds of 7-year maturity 30% Intermediate-Term Taxables Taxable bonds with maturity of 7 years 30% US Diversified S&P 500 Index 15% US Value S&P/Barra Value Index 15% US Growth S&P/Barra Growth Index 15% US Low Vol Equity MSCI US Minimum Volatility Index 15% Developed International MSCI EAFE Unhedged 15% Emerging Markets MSCI Emerging Markets Index 20% US SMID Russell 2500 15% High-Risk Intl Country Fund 15% Global Intermediate Taxable Bonds Hedged 7-year 50% Sovereign and 50% Investment Grade Corporate Debt of Developed Countries30% 6. Volatility Volatility is a measure of dispersion of expected returns around the average. The greater the volatility, the more likely it is that returns in any one period will be substantially above or below the expected result. The volatility for each asset class used in this analysis is listed on the Capital-Market Projections page at the end of these Notes. In general, two-thirds of the returns will be within one standard deviation. For example, assuming that stocks are expected to return 8.0% on a compounded basis and the volatility of returns on stocks is 17.0%, in any one year it is likely that two-thirds of the projected returns will be between (8.9)% and 28.8%. With intermediate government bonds, if the expected compound return is assumed to be 5.0% and the volatility is assumed to be 6.0%, two-thirds of the outcomes will typically be between (1.1)% and 1 1.5%. AB’s forecast of volatility is based on historical data and incorporates AB’s judgment that the volatility of fixed-income assets is different for different time periods. 7. Technical Assumptions AB’s Wealth Forecasting System is based on a number of technical assumptions regarding the future behavior of financial markets. AB’s Capital Markets Engine is the module responsible for creating simulations of returns in the capital markets. These simulations are based on inputs that summarize the current condition of the capital markets as of December 31, 2020. Therefore, the first 12-month period of simulated returns represents the period from December 31, 2020, through December 31, 2021, and not necessarily the calendar year of 2020. A description of these technical assumptions is available on request. Bernstein Private Wealth Management 13 BPWM-331817-2022-12-22 BER-1985-0123 Bernstein.comThe [A/B] logo is a registered service mark of AllianceBernstein, and AllianceBernstein® is a registered service mark, used by permission of the owner, AllianceBernstein L.P., 501 Commerce Street, Nashville, TN 37203. © 2023 AllianceBernstein L.P.The information contained here reflects the views of AllianceBernstein L.P. or its affiliates and sources it believes are reliable as of the date of this publication. AllianceBernstein L.P . makes no representations or warranties concerning the accuracy of any data. There is no guarantee that any projection, forecast or opinion in this material will be realized. Past performance does not guarantee future results. The views expressed here may change at any time after the date of this publication. This document is for informational purposes only and does not constitute investment advice. AllianceBernstein L.P. does not provide tax, legal or accounting advice. It does not take an investor’s personal investment objectives or financial situation into account; investors should discuss their individual circumstances with appropriate professionals before making any decisions. This information should not be construed as sales or marketing material or an offer of solicitation for the purchase or sale of, any financial instrument, product or service sponsored by AllianceBernstein or its affiliates. 8. Tax Implication Before making any asset allocation decisions, an investor should review with his/her tax advisor the tax liabilities incurred by the different investment alternatives presented herein including any capital gains that would be incurred as a result of liquidating all or part of his/her portfolio, retirement-plan distributions, investments in municipal or taxable bonds, etc. AB does not provide tax, legal, or accounting advice. In considering this material, you should discuss your individual circumstances with professionals in those areas before making any decisions. 9. Tax Rates The federal income tax rate represents AB’s estimate of either the top marginal tax bracket or an “average” rate calculated based upon the marginal rate schedule. The federal capital gains tax rate is represented by the lesser of the top marginal income tax bracket or the current cap on capital gains for an individual or corporation, as applicable. Federal tax rates are blended with applicable state tax rates by including, among other things, federal deductions for state income and capital gains taxes. The state income tax rate represents AB’s estimate of the “average” rate calculated based upon the applicable state’s marginal tax schedule. Where an applicable state tax code permits the exclusion of a portion of capital gain income from gross income for purposes of calculating state income tax such exclusions have been included in the calculation. 10. Intentionally Defective Grantor Trusts (IDGTs) The Intentionally Defective Grantor Trust (IDGT) is modeled as an irrevocable trust whose assets are treated as the grantor’s for income tax purposes, but not for gift or estate tax purposes. Some income and transfer-tax consequences associated with transfers to and the operation of an IDGT remain uncertain, and the strategy may be subject to challenge by the IRS. Hence, this technique requires substantial guidance from tax and legal advisors. The grantor may give assets to the trust, which will require using gift tax exemptions or exclusions, or paying gift taxes. The IDGT is modeled with one or more current beneficiaries, and one or more remainder beneficiaries. Distributions to the current beneficiaries are not required, but the system permits the user to structure annual distributions in a number of different ways, including 1) an amount or a percentage of fiduciary accounting income (FAI) (which may be defined to include some or all realized capital gains); 2) FAI plus some principal, expressed either as a percentage of trust assets or as a dollar amount; 3) an annuity, or fixed-dollar amount, which may be increased annually by inflation, or by a fixed percentage; 4) a unitrust, or annual payment of a percentage of trust assets, based on the trust’s value at the beginning of the year, or average over multiple years; or 5) any combination of the above four payout methods. Because the IDGT is modeled as a grantor trust, the system calculates all taxes on income and realized capital gains that occur in the IDGT portfolio each year, based on the grantor’s tax rates and other income, and pays them from the grantor’s personal portfolio. The IDGT may continue for the duration of the analysis, or the trust assets may be distributed in cash or in kind at a specific point in time or periodically to (1) a non-modeled recipient, (2) a taxable trust, or (3) a taxable portfolio for someone other than the grantor. If applicable, an installment sale to an IDGT may be modeled as a user-entered initial “seed” gift followed by a sale of additional assets to the trust. The system will use one of two methods to repay the value of the sale assets plus interest (less any user-specified discount to the grantor): 1) user-defined payback schedule, or 2) annual interest-only payments at the applicable federal rate (AFR) appropriate for the month of sale and the term of the installment note, with a balloon payment of principal plus any unpaid interest at the end of the specified term."}
{"text": "T ax Planning Strategies5 RETURN TO TOC Tax Planning Strategies In addition to saving income taxes for the current and future years, effective tax planning can reduce eventual estate taxes, maximize the amount of funds you will have available for retirement, reduce the cost of financing your children’s education, and assist you in managing your cash flow to help you meet your financial objectives. EisnerAmper 2020 Personal T ax Guide6 RETURN TO TOCT ax planning strategies can defer some of your current year’s tax liability to a future year, thereby freeing up cash for investment, business, or personal use. This can be accomplished by timing when certain expenses are paid, or controlling when income is recognized. T ax planning allows you to take advantage of tax rate differentials between years. However, if tax rates rise in a subsequent year, extra caution may be necessary. As a result of the T ax Cuts and Jobs Act of 2017 (“TCJA ”), the alternative minimum tax (“ AMT”) will likely affect less taxpayers than in past years, so some of the tax strategies utilized in prior years will no longer be applicable. The key factors you should consider when identifying strategies to minimize your taxes are: • Prior to 2018, while residents of states with high income and property taxes (such as New York, California, Connecticut, Pennsylvania and New Jersey) were able to deduct the full amount of state income and property taxes against federal taxable income, they most likely did not receive a benefit if they were subject to the AMT. Beginning after December 31, 2017, state income and property tax deductions are limited to $10,000 and the deduction continues to be subject to the AMT. It is now less likely that the AMT will apply to many taxpayers. • In addition to the limitations on state income and property taxes, miscellaneous itemized deductions such as investment expenses, unreimbursed business expenses, and professional fees are no longer deductible. Residents of New York will still be able to deduct real estate taxes and miscellaneous itemized deductions on their NYS income tax returns, though they may be limited based on their adjusted gross income (“ AGI”). Also, exemptions are completely repealed and instead have been consolidated into the standard deduction. • The current top long-term capital gains tax rate is 20%. Including the additional 3.8% Medicare Contribution T ax on net investment income, the top federal long-term capital gains rate could be 23.8% | Tax Planning Goals Proper tax planning can achieve the following goals: • Reduce the current year’s tax liability. • Defer the current year’s tax liability to future years, thereby increasing availability of cash for investment, business, or personal needs. • Reduce any potential future years’ tax liabilities. • Maximize the tax savings from allowable deductions. • Minimize the effect of the AMT on this year’s tax liability. • Maximize tax savings by taking advantage of available tax credits. • Maximize the amount of wealth that stays in your family. • Minimize capital gains tax. • Minimize the Medicare Contribution T ax on net investment income. • Avoid penalties for underpayment of estimated taxes. • Manage your cash flow by projecting when tax payments will be required. • Minimize potential future estate taxes to maximize the amount left to your beneficiaries and/or charities (rather than the government). • Maximize the amount of money you will have available to fund your children’s education as well as your retirement. and the top federal short-term capital gains tax rate could be as much as 40.8% in 2019 and 2020. • Under the TCJA, taxpayers may defer tax on prior short-term and/or long-term capital gains if the amount of the gain is invested in a qualified opportunity fund. Investors can reinvest their capital gains into areas that need investment (qualified opportunity zones). Gains can come from any T ax Planning Strategies7 RETURN TO TOCinvestment, whether that is from stocks, bonds, real estate or partnership interests. T o qualify for certain tax breaks, investors must invest their capital gains in a qualified opportunity fund within 180 days of realizing those gains. The money cannot be invested directly into a property, and funds must invest 90% of their capital into opportunity zone properties. For gains realized from flow-through entities, the date realized is deemed to be December 31 (or the year-end of the entity if a fiscal year). • Under current law, the complex netting rules have the potential effect of making your long-term capital gains subject to short-term rates, so you must carefully time your security trades to ensure that you receive the full benefit of the lowest capital gains tax rate. • Gift and estate taxes can reduce the amount your beneficiaries will receive by 40% to 50%, depending on which state one is a resident of at date of death. However, there are planning techniques and strategies available to maximize the amount of wealth that is preserved for your family. | Year-End Tax Planning Tips T ax Tip 1 provides a snapshot of key strategies geared toward helping you achieve your planning goals. It includes ideas to help you reduce your current year’s tax as well as any potential future taxes. While this chart is not all inclusive, it is a good starting point to help you identify planning ideas that might apply to your situation. Keep in mind that many of the strategies involve knowing what your approximate income, expenses and tax rates will be for the current and subsequent years and then applying the applicable tax law for each year to determine the best path to follow. Implementation of many of these ideas requires a thorough knowledge of tax laws, thoughtful planning and timely action. Timing when you pay deductible expenses and when you receive income (to the extent you have control) can reduce your taxes. Timing expenses and income can also defer some of your tax liability to next year (or even later years) giving you, rather than the government, use of your money. T o gain the maximum benefit, you need to project, as best you can, your tax situation for the current and subsequent years. This will help you identify your tax bracket for each year. Your year-to-date realized long- and short-term capital gains and losses should be included in your projections. Be sure to consider prior- year loss carryforwards (if any). Based on these results, you can decide what steps to take prior to year-end. You will be able to decide whether or not you should prepay deductions and defer income, defer expenses and accelerate income, realize capital losses, or lock in capital gains. T ax Tip 2 offers basic guidance for deciding when to prepay or defer deductible expenses and when to defer or collect taxable income. T ax Tip 3 offers steps to follow relating to realized capital gains and/or losses, and the type of gains and losses you should trigger. | Expenses You Can Prepay Here are the most common deductible expenses you can easily prepay by December 31, if appropriate: Charitable Contributions You can deduct charitable gifts of cash up to 60% of your AGI, tangible personal property, such as clothing and household goods, up to 50% of your AGI and charitable gifts of appreciated capital gain properties up to 30% of your AGI. These percentages apply to gifts made to public charities. Be sure to work through the calculations though, as gifting different types of property to charities with varying exempt status (such as private foundations), can limit the amount of the deduction allowed in a particular year. State and Local Income Taxes and Property Taxes A taxpayer may claim an itemized deduction of up to EisnerAmper 2020 Personal T ax Guide8 RETURN TO TOC1. Key Tax Planning Strategies Situation Your regular tax rate will be the same or lower next year and the AMT will not apply in either year. Your regular tax rate will increase next year and the AMT will not apply in either year. The regular tax rate applies this year and is higher than the AMT rate that you expect will apply next year. This year you are in the AMT and next you will be subject to a higher regular tax rate. You have net realized capital losses this year or loss carryforwards from last year. You have net realized capital gains this year. You are contemplating purchasing new business equipment. A penalty for underpayment of estimated taxes will apply. You want to diversify a concentrated low- basis stock position and avoid paying taxes currently. You have incentive stock options that you can exercise. Your passive activity losses exceed your passive income.Planning idea Detailed discussion • Prepay deductions. P age 7 • Defer income. P age 10 • Defer deductions. P age 10 • Accelerate income, but only if the tax rate increase warrants accelerating tax payments. • Consider bunching charitable contributions in the year P age 27 with the higher tax rate – assuming you can itemize. • Defer income. • Consider bunching charitable contributions in the year P age 27 with the higher tax rate – assuming you can itemize. • Accelerate income. • Consider recognizing capital gains by selling appreciated P age 11 securities to offset realized losses and loss carryforwards, thereby locking in the appreciation. • Sell securities with unrealized losses to offset the gains – P age 11 if market conditions justify it. • Use a bond swap to realize losses. P age 47 • Consider tax implications of netting rules. P age 43 • Avoid wash sale rules. P age 47 • Consider the implications of the Medicare Contribution T ax P age 19 on net investment income. • Considering Investing in a qualified opportunity fund. P age 42 • Accelerate the purchases into 2020 to take advantage of IRC P age 32 Sec. 179 deductions available this year. (Qualified purchases must be placed in service in 2020.) • Withhold additional amounts of tax from your wages before P age 22 December 31. • Prepay fourth quarter estimates due January 15 and increase the payment amount, if necessary. • Have withholding taken out of your retirement plan distribution. • Consider using a charitable remainder trust that will allow you P age 89 to sell the stock in exchange for an annuity. This will allow you to defer the tax while benefiting a charity of your choice. • Consider exercising your options to start the long-term holding P age 52 period, but only if the spread between the market price of the stock and the exercise price will not put you into the AMT. • Dispose of an activity that is generating passive losses in order P age 66 to deduct the suspended loss on that activity. However, consider the impact of the Medicare Contribution T ax on net investment income.Tax Tip T ax Planning Strategies9 RETURN TO TOCSituation You would like to make significant charitable contributions. You need funds for personal use, such as improvements to your home in excess of the mortgage limitations or to pay tax liabilities. You want to take advantage of the tax- deferred nature of retirement accounts. You expect the value of your IRA to appreciate over time, and you want to position your IRA now so that there will be little or no tax impact when you or your beneficiaries take distributions later. You have a sizeable estate and want to protect your assets from estate tax. You want to transfer assets to your designated beneficiaries during your lifetime. You want to provide for your children’s and/ or grandchildren’s qualified education costs.Planning idea Detailed discussion • Donate appreciated securities you have held for more than P age 83 one year. • Consider establishing a charitable trust or a private foundation, P age 86 or take advantage of a donor-advised fund. • Consider donating partial interests in certain assets such as a P age 85 conservation easement, remainder interest in real estate or art work to a museum. • Sell marketable securities with little or no appreciation to fund P age 96 your needs, and then use margin debt to purchase replacement securities. The interest on the debt will be deductible, subject to investment interest limitations. The interest may also reduce the Medicare Contribution T ax on net investment income. • T ake distributions, if available, from partnerships, limited liability P age 35 companies, or S corporations on income that you have already paid taxes on. Be sure you have sufficient tax basis and are “at risk” in the entity. • Maximize your contributions to your retirement accounts and take P age 100 advantage of the best plans available to you prior to December 31. • Consider converting your traditional IRA into a Roth IRA in the current P age 104 year. However, this will cause a current tax liability, since the converted amount is subject to income tax in the year of the conversion. • Make gifts of $15,000 to each individual in 2020. These gifts would P age 110 not be subject to gift tax. • Pay beneficiaries’ tuition and medical expenses directly to the providers. P age 113 • Use your cumulative lifetime gift tax exclusion of $11.58 million for 2020. P age 112 For subsequent years, the exclusion will be indexed for inflation, using the chained Consumer Price Index (“CPI”). • Create a grantor retained annuity trust (“GRAT”). P age 115 • Set up a family limited partnership (“FLP”) or family limited liability P age 115 company (“FLLC”). • Make loans to your beneficiaries at minimum required interest rates. P age 113 • Establish and fund a 529 plan that can grow tax-free as long as P age 128 you use the funds to pay qualified education expenses. You have the ability to prepay up to $75,000 (or $150,000 if your spouse consents to gift-splitting) without incurring a gift tax. • Prepay college or private school tuition gift-tax-free by making P age 113 payments directly to the educational institution.1. Key Tax Planning StrategiesTax Tip EisnerAmper 2020 Personal T ax Guide10 RETURN TO TOCLegend = Prepay before the end of the current year/Defer into next year or later/Collect before the end of the year. *The chart assumes your regular tax rate on ordinary income is higher than the maximum AMT tax rate of 28%. You will not be in the AMT this year or next year and next year’s tax rate You are in the AMT* will be the same this year Nature of deduction as the current year will only and only or income or will decrease increase this year next year next year Charitable contributions, mortgage Prepay Defer Defer Prepay Prepay interest, investment interest and self-employed expenses Income such as bonuses, Defer Collect Collect Defer Defer self-employed consulting fees, retirement plan distributions, and net short-term capital gains (unless you have long-term losses offsetting the gains)business equipment to take advantage of expensing allowances, subject to certain limitations. T o qualify, the property must be placed in service in the year of the intended deduction. | Income You Can Accelerate or Defer Timing income can be more difficult than timing deductions, but here are some types of income that you may be able to control the timing of receipt so you can gain the advantage of having the income taxed in a year that you are in a lower tax bracket. Cash Salaries or Bonuses If you anticipate your current year’s income tax rate to be lower than next year’s rate, you can accelerate salary or bonuses into the current year. You would need to determine if there are strict limitations on amounts that can be accelerated. However, if next year’s rate is lower than your current year’s rate, it may make sense to defer such income until next year provided the $10,000 ($5,000 for married filing separately) for the aggregate of (1) state and local income taxes and (2) state and local property taxes paid. Miscellaneous Itemized Deductions All miscellaneous itemized deductions that are subject to the limitation of 2% of AGI will be suspended until years beginning after December 31, 2025. Mortgage Interest Before the end of 2020, consider prepaying your mortgage payment for next January in the current year in order to accelerate the deduction. Margin Interest Before the end of 2020, be sure to pay any margin interest before December 31, since interest accrued at year-end is only deductible if actually paid. This may also reduce the Medicare Contribution T ax on net investment income. Business Equipment Before the end of 2020, accelerate the purchases of 2. AMT Tax Planning StrategiesTax Tip T ax Planning Strategies11 RETURN TO TOCincome is not constructively received (made available to you in the current year). Consulting or Other Self-Employment Income If you are a cash-basis business and you anticipate your current year’s tax rate to be lower than next year’s rate, you can accelerate income into the current year. Otherwise, you would want to defer such income. Retirement Plan Distributions If you are over age 59½ and your tax rate is low this year, you may consider taking a taxable distribution from your retirement plan even if it is not required, or consider a Roth IRA conversion. Individuals of at least age 70½ are allowed to make tax-free distributions of up to $100,000 from individual retirement accounts (“IRAs”) to public charities. This allows an individual to exclude the distribution from income; thereby reducing your state income taxes in states that limit or disallow the charitable contribution deduction. Capital Gains The following ideas can lower your taxes this year: • If you have unrealized net short-term capital gains, consider selling the positions and realize the gains in the current year if you expect next year’s tax rate to be higher. Only consider this strategy if you do not otherwise intend to hold the position for more than 12 months, making it eligible for the long-term capital gain rate of 20%, exclusive of the additional Medicare Contribution T ax. However, you may be able to apply the netting rule which may result in the offsetting of long-term losses to short-term gains, resulting in a tax savings of 37% in 2020 rather than 20%. • Considering investing in a qualified opportunity fund. • Review your portfolio to determine if you have any securities that you may be able to claim as worthless, thereby giving you a capital loss before the end of the year. A similar rule applies to bad debts. • Avoid wash sales. Loss recognition is disallowed if the same or substantially identical security is purchased 30 days before or after the sale of the security that created the loss. • Consider a bond swap to realize losses in your bond portfolio. This swap allows you to purchase similar bonds and avoid the wash sale rule while maintaining your overall bond positions. Note: If you are married filing separately, substitute $1,500 for $3,000 in the above tip. If you have Consider taking these st eps Both short-term and long-term losses Sell securities to r ecognize unrealized gains, preferably if held short-term, up to the amount of your losses, less $3,000. Long-term gains in excess of short-term losses T ake losses equal to the net gain, plus $3,000. Use long-term loss positions first, then short-term loss positions. Both short-term and long-term gains, or T ake losses equal to the net gain, plus $3,000. Use long-term loss positions short-term gains in excess of long-term losses fir st to gain the benefit of offsetting short-term gains (taxed at a rate as high as 37% in 2020 plus 3.8% Medicar e Contribution T ax on net investment income). Worthless securities and bad debts Identif y these securities and debts and take the necessary steps to ensure that the losses are deductible in the current year, by having the proper substantiation.3. Year-End Capital Gains and LossesTax Tip EisnerAmper 2020 Personal T ax Guide12 RETURN TO TOC• Similarly, you may consider selling securities this year to realize long-term capital gains that may be taxed at the more favorable rate this year, and then buying them back to effectively gain a step-up in basis. Since the sales are at a gain, the wash sale rules do not apply. Real Estate and Other Non-Publicly Traded Property Sales If you are selling real estate or other non-publicly traded property at a gain, you would normally structure the terms of the arrangement so that most of the payments would be due next year. You can use the installment sale method to report the income. This would allow you to recognize only a portion of the taxable gain in the current year to the extent of the payments you received, thereby allowing you to defer much of that tax to future years. U.S. Treasury Bill Income If you have U.S. Treasury Bills maturing early next year, you may want to sell these bills to recognize income in the current year if you expect to be in a lower tax bracket this year than next year. | Bunching Deductions Medical ExpensesAs a result of the Further Consolidated Appropriations Act, the 7.5% of AGI threshold has been retained for 2019 and 2020. Thereafter, the threshold will revert to 10% of AGI.Therefore, bunching unreimbursed medical expenses into a single year could result in a tax benefit. Medical expenses include health insurance and dental care. If you are paying a private nurse or a nursing home for a parent or other relative, you can take these expenses on your tax return even if you do not claim the parent or relative as your dependent, assuming you meet certain eligibility requirements.Charitable Contributions As a result of the TCJA, many itemized deductions have been eliminated or limited. The deduction for the charitable contribution is the exception, as it has virtually been untouched by the new law. At the same time, the standard deduction has increased substantially. An individual can deduct the larger of either his/her standard deduction or itemized deductions. Thus, in order to maximize the deduction for charitable contributions, it might be best to bunch gifts to charities in one year, so the individual’s charitable contributions exceed the standard deduction amounts, and he or she will be able to itemize. Similarly, funding a donor-advised fund, private foundation or a charitable trust in a particular year may be effective in maximizing the tax benefit of such charitable deductions. | Ad just Year-End Withholding or Make Estimated Tax Payments If you expect to be subject to an underpayment penalty for failure to pay your current-year tax liability on a timely basis, consider increasing your withholding and/ or make an estimated tax payment between now and the end of the year in order to eliminate or minimize the amount of the penalty. | Utilize Business Losses or Take Tax-Free Distributions It may be possible to deduct losses that would otherwise be limited by your tax basis or the “at risk” rules. Or, you may be able to take tax-free distributions from a partnership, limited liability company (“LLC”) or S corporation if you have tax basis in the entity and have already been taxed on the income. If there is a basis limitation, consider contributing capital to the entity or making a loan under certain conditions. See further discussion in the chapter on business owner issues and depreciation deductions. T ax Planning Strategies13 RETURN TO TOC| P assive Losses If you have passive losses from a business in which you do not materially participate that are in excess of your income from these types of activities, consider disposing of the activity. The tax savings can be significant since all losses become deductible when you dispose of the activity. Even if there is a gain on the disposition, you can receive the benefit of having the long-term capital gain taxed at 23.8% (28.8% if the gain is subject to depreciation recapture) inclusive of the Medicare Contribution T ax with all the previously suspended losses offsetting ordinary income at a potential tax benefit of 40.8% in 2020 inclusive of the Medicare Contribution T ax. | I ncentive Stock Options Review your incentive stock option plans (“ISOs”) prior to year-end. A poorly timed exercise of ISOs can be very costly since the spread between the fair market value of the stock and your exercise price is a tax preference item for AMT purposes. If you are in the AMT, you will have to pay a tax on that spread, generally at 28%. If you expect to be in the AMT this year but do not project to be next year, you should defer the exercise. Conversely, if you are not in the AMT this year, you should consider accelerating the exercise of the options; however, keep in mind to not exercise so much as to be subject to the AMT. | Estat e Planning If you have not already done so, consider making your annual exclusion gifts to your beneficiaries before the end of the year. You are allowed to make tax-free gifts of up to $15,000 per year, per individual ($30,000 if you are married and use a gift-splitting election, or $15,000 from each spouse if the gift is funded from his and her own separate accounts). By making these gifts, you can transfer substantial amounts out of your estate without using any of your lifetime exclusion. Also, try to make these gifts early in the year to transfer that year’s appreciation out of your estate. Furthermore, because of the increased cumulative lifetime gift exclusion in 2020, you may wish to make additional gifts to fully utilize such exclusion of $11.58 million ($23.16 million for married couples). The lifetime gift exclusion has doubled as a result of the TCJA; however, it will sunset at the end of 2025 reverting back to the maximum lifetime gift exclusion in effect before the TCJA became law. When combined with other estate and gift planning techniques such as a grantor retained annuity trust, tax planning strategies may enable you to avoid estate and gift taxes and transfer a great deal of wealth to other family members (who may be in a lower income tax bracket or may need financial assistance). Note: The amount of the lifetime gift exclusion will be adjusted annually for the chained CPI. | T ax Strategies for Business Owners Timing of Income and Deductions If you are a cash-basis business and expect your current year’s tax rate to be higher than next year’s rate, you can delay billing until January of next year for services already performed in order to take advantage of the lower tax rate next year. Similarly, even if you expect next year’s rate to be the same as this year’s rate, you should still delay billing until after year-end to defer the tax to next year. You also have the option to prepay or defer paying business expenses in order to realize the deduction in the year that you expect to be subject to the higher tax rate. This can be particularly significant if you are considering purchasing (and placing in service) business equipment. If you are concerned about your cash flow and want to accelerate your deductions, you can charge the purchases on the company’s credit card. This will allow you to take the deduction in the current year when the charge is made, even though you may EisnerAmper 2020 Personal T ax Guide14 RETURN TO TOCnot actually pay the outstanding credit card bill until after December 31. Business Equipment T ax benefits are available for immediate deduction of business equipment purchased and placed in service in 2020. The amount allowable for full deduction in 2020 under IRC Sec. 179 is $1,000,000 if property placed in service does not exceed $2,590,000. After reaching this threshold, the deduction is phased out, dollar-for-dollar, up to $3,590,000. Bonus depreciation was increased to 100% for property placed in service after September 27, 2017. The allowable bonus percentage decreases by 20% each year, beginning in 2023 with 2026 being the last year at 20% bonus. The TCJA expands the definition of qualified property to include used property (as long as the taxpayer did not use the property prior to the purchase). Note: Under the TCJA, some businesses may not be eligible for the bonus depreciation. For example, bonus depreciation is not allowed for businesses with annual gross receipts of more than $25 million for the prior three years and real estate businesses that elect to deduct 100% of their business interest expenses. Note: The bonus depreciation is an addback on most state returns while IRC Sec. 179 expense is only a partial addback. Business Interest If you have debt that can be traced to your business expenditures – including debt used to finance the capital requirements of a partnership, S corporation or LLC involved in a trade or business in which you materially participate – you can deduct the interest “above-the-line” as business interest rather than as an itemized deduction. The interest is a direct reduction of the income from the business. This allows you to deduct all of your business interest, even if you are a resident of a state that limits or disallows all of your itemized deductions.Business interest also includes finance charges on items that you purchase for your business (as an owner) using the company’s credit card. These purchases are treated as additional loans to the business, subject to tracing rules that allow you to deduct the portion of the finance charges that relate to the business items purchased. Credit card purchases made before year-end and paid for in 2021 are allowable deductions in 2020 for cash basis businesses. Note: Interest expense deduction is limited to 30% of adjusted taxable income (“ATI”). Such limitation does not apply to: • Businesses with average gross receipt that do not exceed $25 million • Electing real property trade or business Qualified Business Income Deduction Qualified business income (“QBI”) is generally defined as net income and deductions that are effectively connected to a U.S. business. Through 2025, the TCJA provides an IRC Sec. 199A deduction for sole proprietors and owners of pass-through entities of a “qualified” business generally equal to 20% of qualified business income, subject to various loss and deduction limitation. Though this deduction is not allowed in calculating the owner’s AGI, it does reduce the taxable income. Excess Business Losses and Net Operating Losses Excess losses from all of your trades or businesses are limited to $510,000 (married filing jointly) and $255,000 (all others). Any losses above these amounts will be carried forward as a net operating loss (“NOL”). Beginning in tax years after December 31, 2017, NOLs can no longer be carried back. NOLs can be used to offset 80% of taxable income in future years with any excess to be carried forward indefinitely."}
{"text": "Just because you filed your tax return, it doesn’t mean you don’t need to think about taxes for the rest of the year. What you do during the year may affect any tax you could owe or refund you may expect next year. Check your tax withholding throughout the year Since federal taxes operate on a pay-as-you-go basis, you need to pay most of your tax during the year as you earn income. If you don’t pay your tax through withholding, or don’t pay enough tax that way, you might have to pay estimated tax. It’s a good idea to make sure you’re not having too little tax withheld, which could lead to a smaller than expected refund or even a tax bill. Or, you may want to check that you aren’t having too much tax withheld, if having that extra money in each paycheck is more helpful than getting a larger refund when you file. Use the IRS Tax Withholding Estimator to check your withholding when personal or financial information changes occur due to a life event, like getting married or divorced , having a baby or getting a raise at work. You’ll need to give your employer an updated Form W-4 to change how much tax is withheld from your paycheck. Some taxpayers earn income not subject to withholding. Small business owners and self-employed people—including gig economy workers—may need to make quarterly estimated tax payments . Organize your tax records Develop a recordkeeping system—electronic or paper—that keeps your important information together. Add tax records to the files as you receive them. This includes year-end Forms W-2 from employers, Forms 1099 from banks and other payers, other income documents and records of virtual currency transactions. Having records organized makes preparing a tax return easier. It may also help you discover potentially overlooked deductions or credits. Notify the IRS if your address changes and notify the Social Security Administration of a legal name change to avoid a delay in processing your tax return. View your account information online Securely access your individual tax account online at IRS. gov/account to see your balance, make payments, view payments and payment plan details, and more. IRS resources available in Spanish, Chinese, Korean, Russian, Vietnamese and Haitian-Creole We know that tax information can be hard to understand in any language. It can be even harder if that information isn’t offered in the language you know best. We’re translating our tax resources into more languages. The Let Us Help You page highlights IRS resources for taxpayers in seven languages. The agency is also inserting information about translation services and other multilingual options into the top notices sent to taxpayers. For more information, see the We Speak Your Language page on IRS.gov. Life events can affect your taxes Life events, such as purchasing a home, going to college or losing a job, may make you eligible for certain tax benefits. Other circumstances, such as getting married or divorced , welcoming a child or experiencing the death of a spouse or a dependent you claim, could also affect your tax benefit eligibility and filing status. To learn more about managing your taxes after a life event, visit IRS.gov/lifeevents . Know how Adjusted Gross Income (AGI) affects your taxes Your AGI and tax rate are important factors in figuring your taxes. AGI is your income from all sources minus any adjustments or deductions to your income. Generally, the higher the AGI, the higher the tax rate, and the more tax you pay. Tax planning can include making changes during the year that can lower your AGI. There are several ways to reduce your AGI, including contributing to a retirement account or Health Savings Account , claiming educator expenses if you’re a qualifying educator, and paying student loan interest . Be prepared to claim tax credits and deductions Taxable income is what’s left over after you subtract any eligible deductions , including your standard deduction , from your AGI. Most people take the standard deduction, but some may choose to itemize deductions because it could lower their taxable income even more. As a general rule, if your itemized deductions are greater than the standard deduction, you should itemize. Use the Interactive Tax Assistant to see whether itemizing is right for you. YEAR-ROUND TAX PLANNING IS FOR EVERYONE Maximize your tax refund You may qualify for tax credits, like the Earned Income Tax Credit , Child and Dependent Care Credit , Child Tax Credit and the Credit for Other Dependents . Families with students may qualify for education credits . Properly claiming these tax credits can reduce taxes owed and boost refunds, so you should see if you qualify. Keep records that show your eligibility for credits you claim. This includes agency letters about advance credit payments you receive. Don’t miss out on your refund by not filing Many people may lose out on their tax refund simply because they did not file a federal income tax return. By law, they only have a three-year window from the original due date, normally the April deadline, to claim their refunds. Some people may choose not to file a tax return because they didn’t earn enough money to be required to file . Generally, they won’t be penalized if they are owed a refund. But, they may miss out on receiving a refund if they don’t file a tax return. Get help filing your return Tax professionals play an essential role in the U.S. tax system. Certified public accountants, Enrolled Agents, attorneys and others without formal credentials are just a few of the professionals who help taxpayers file their returns accurately. It is important to choose a professional who is skilled and trustworthy. Most tax return professionals provide great service but picking the wrong one can hurt taxpayers financially. The IRS offers tips for choosing a tax preparer . People can use the IRS Directory of Federal Tax Return Preparers with Credentials and Select Qualifications to find qualified professionals. Those who qualify can get free tax help from IRS certified volunteers through the Volunteer Income Tax Assistance (VITA) or Tax Counseling for the Elderly (TCE) program. VITA/TCE services are not only free, in communities across the country, they’re also a reliable and trusted source for preparing tax returns. Direct File Direct File is a permanent option to file individual federal tax returns online – for free – directly and securely with the IRS. Direct File is an option for taxpayers in participating states who have relatively simple tax returns reporting certain types of income and claiming certain credits and deductions. While Direct File doesn’t prepare state returns, if you live in a participating state, Direct File guides you to a state-supported tool you can use to prepare and file your state tax return for free. Stay connected with the IRS The official IRS website is IRS.gov. Follow IRS on X , Facebook , LinkedIn and Instagram for the latest updates on tax changes, scam alerts, initiatives, products and services. Watch IRS YouTube videos and subscribe to IRS e-newsletters . Download the IRS2Go mobile app to quickly check your refund status, make a payment, and get tax tips. Social media can circulate inaccurate or misleading tax information. Taxpayers should always remember that if something sounds too good to be true, it probably is. Taxpayers can follow the IRS on X with @IRStaxsecurity for help avoiding common scams that could put their money and information at risk. Tax prep checklist Gather these items prior to filing your tax return \u0083Social Security numbers for you, your spouse and dependents or an Individual Taxpayer Identification Number if you, your spouse or your dependents do not have a Social Security number \u0083Birth dates for you, your spouse and dependents on the tax return \u0083Wage and earning statements (Form W-2, W-2G, 1099-R,1099-Misc) from all employers, issuing agencies or payers , including Form 1099-G, Certain Government Payments, for any taxable unemployment compensation \u0083Forms 1099 for interest and dividend statements from banks and other payers \u0083A copy of last year’s federal and state returns \u0083Bank account routing and account numbers for direct deposit \u0083Total paid for daycare or dependent care expenses and the provider’s tax number, such as their Social Security number or business Employer Identification Number \u0083Form 1095-A, Health Insurance Marketplace Statement \u0083IRS correspondence including notices, letters and forms related to adjustments, payments and your current IP PIN Get Banked if you don’t have an account to speed refunds with direct deposit Direct deposit gives you access to your refund faster than a paper check. Don’t have a bank account? Learn how to open an account online at an FDIC-Insured bank or through the National Credit Union Locator Tool . If you are a Veteran, see the Veterans Benefits Banking Program (VBBP) for access to financial services at participating banks. Disaster preparedness Taxpayers should place original documents such as tax returns, birth certificates, deeds, titles and insurance policies inside waterproof containers in a secure space. Duplicates of these documents should be kept with a trusted person outside the area of the taxpayer. Scanning them for electronic backup storage is another option that provides security and portability. Current photos or videos of a home’s contents can help support claims for insurance or tax benefits after a disaster. The IRS disaster-loss workbooks in Publication 584 can help compile these lists. Publication 5349 (Rev. 11-2024) Catalog Number 72927 S Department of the Treasury Internal Revenue Service www.irs.gov"}
